# ZThon - ZelZal
# Copyright (C) 2022 ZThon . All Rights Reserved
#< https://t.me/ZThon >
# This file is a part of < https://github.com/Zed-Thon/ZelZal/ >
# PLease read the GNU Affero General Public License in
# <https://www.github.com/Zed-Thon/ZelZal/blob/master/LICENSE/>.

import json
import math
import os
import aiohttp
import requests
import random
import re
import time
from uuid import uuid4
import sys
import asyncio
from validators.url import url
from subprocess import run as runapp
from datetime import datetime
from pySmartDL import SmartDL
from pathlib import Path
from platform import python_version
from telethon import Button, functions, events ,types, version
from telethon.errors import QueryIdInvalidError
from telethon.events import CallbackQuery, InlineQuery
from telethon.utils import get_display_name
from telethon.tl.types import InputMessagesFilterDocument
from . import StartTime, zedub, zedversion
from ..Config import Config
from ..helpers.functions import rand_key
from ..core import check_owner, pool
from ..core.logger import logging
from ..core.managers import edit_delete, edit_or_reply
from ..sql_helper.globals import addgvar, delgvar, gvarstatus
from ..helpers.utils import reply_id, _format
from ..helpers.tools import media_type
from . import media_type, progress
from ..utils import load_module, remove_plugin
from ..sql_helper.global_collection import add_to_collectionlist, del_keyword_collectionlist, get_collectionlist_items
from . import SUDO_LIST, edit_delete, edit_or_reply, reply_id, BOTLOG, BOTLOG_CHATID, HEROKU_APP, mention


LOGS = logging.getLogger(os.path.basename(__name__))
LOGS1 = logging.getLogger(__name__)
ZORDR = gvarstatus("Z_ORDR") or "الاوامر"
ZLORDR = gvarstatus("Z_LORDR") or "الاوامر"
ppath = os.path.join(os.getcwd(), "temp", "githubuser.jpg")
GIT_TEMP_DIR = "./temp/"
cmdhd = Config.COMMAND_HAND_LER
DELETE_TIMEOUT = 1
USERID = bot.uid if Config.OWNER_ID == 0 else Config.OWNER_ID
ALIVE_NAME = Config.ALIVE_NAME
thumb_image_path = os.path.join(Config.TMP_DOWNLOAD_DIRECTORY, "thumb_image.jpg")
Malath = f"**🖥┊لـوحـة اوامـر الانينمـَوس  **\n**🧑🏻‍💻┊المستخـدم ↶** {mention} \n\n•❶•** اوامــر الـبحـث والـتحميـل **\n•❷•** اوامــر الـبـوت **\n•❸•** اوامــر الـوقـتـي **\n•❹•** اوامــر المجمـوعـة¹ **\n•❺•** اوامــر المجمـوعـة² **\n•❻•** اوامــر الـحسـاب **\n•❼•** اوامــر الميـديـا والـصيــغ **\n•❽•** اوامــر الـفــارات **\n•❾•** اوامــر الخـدمــات العـامــه **\n•❿•** اوامــر الالعــاب **\n•⓫•** اوامــر الـتســليــه**\n•⓬•** اوامــر التحشيـش**\n•⓭•** اوامــر الستـوريات**\n•⓮•** اوامــر الآفتــارات**\n•⓯•** اوامــر الصيــد والتشيكــر **\n•⓰•** اوامــر النشــر التلقــائي **\n•⓱•** اوامــر تجميــع النقــاط **\n•⓲•** اوامــر الاشتـراك الإجبـاري **\n•⓳•** اوامــر الإضـافة والتفليــش**\n•⓴•** اوامــر النشـر العـام (الـسوبـرات)**\n\n**•❐• لعـرض الاوامـر مع الوصـف ارسـل** `.اوامري`\n**•❐• لعـرض شـروحـات الاوامـر ارسـل** `.مساعده` "
TG_BOT = Config.TG_BOT_USERNAME
TM = time.strftime("%I:%M")
Channels = f"**❖ مـرحبــاً عـزيـزي  {mention} **\n**❖ اليـك مجمـوعــة قنـوات الانينمـَوس ↵ 𝐀𝐍𝐘𝐍𝐌𝐔𝐒 **\n\n**❖ استـخـدم الازرار بالاسفــل↓**"
Zelzal = f"**❖ اصــدار الســورس ❖ 8.3**  \n**❖ المستخــدم ⤽**  {mention}  \n**•◈• وقــت التشغيــل ⤽  {TM}  **\n**❖ البــوت المســاعـد ⤽  {TG_BOT} **\n**❖ قنــاة الســورس ⤽  @ANENMUS **"
TGT_BOT = Config.TG_BOT_USERNAME
TM = time.strftime("%I:%M")
Channels = f"**❖ مـرحبــاً عـزيـزي  {mention} **\n**❖ اليـك مجمـوعــة قنـوات الانينمـَوس ↵ 𝐀𝐍𝐘𝐍𝐌𝐔𝐒 **\n\n**•❐• استـخـدم الازرار بالاسفــل↓**"
Zelzal = f"**❖ اصــدار الســورس ❖ 0**  \n**❖ المستخــدم ⤽**  {mention}  \n**❖ وقــت التشغيــل ⤽  {TM}  **\n**❖ البــوت المســاعـد ⤽  {TGT_BOT} **\n**❖ قنــاة الســورس ⤽  @ANENMUS **\n︎ "


#لـوحــة الاوامــر - حقــوق زدثـــون

@zedub.tgbot.on(events.InlineQuery)
@check_owner
async def zed_handler(event):
    builder = event.builder
    result = None
    query = event.text
    await zedub.get_me()
    if query.startswith("الاوامر") and event.query.user_id == zedub.uid:
        buttons = [[Button.inline("❶", data="ahmed1"), Button.inline("❷", data="ahmed2"), Button.inline("❸", data="ahmed3"), Button.inline("❹", data="ahmed4"),],[Button.inline("❺", data="ahmed5"), Button.inline("❻", data="ahmed6"), Button.inline("❼", data="ahmed7"), Button.inline("❽", data="ahmed8"),],[Button.inline("❾", data="ahmed9"), Button.inline("❿", data="ahmad10"), Button.inline("⓫", data="ahmad11"),],[Button.inline("⓬", data="ahmad12"), Button.inline("⓭", data="ahmad13"), Button.inline("⓮", data="ahmad14"), Button.inline("⓯", data="ahmad15"),],[Button.inline("⓰", data="ahmad16"), Button.inline("⓱", data="ahmad17"),],[Button.inline("⓲", data="ahmad18"), Button.inline("⓳", data="ahmad19"), Button.inline("⓴", data="ahmadd20"),]]
        result = builder.article(title="zedub",text=Malath,buttons=buttons,link_preview=False)
        await event.answer([result] if result else None)
@zedub.zed_cmd(pattern="الاوامر(?: |$)(.*)")
async def repozedub(event):
    if event.fwd_from:
        return
    if event.reply_to_msg_id:
        await event.get_reply_message()
    response = await event.client.inline_query(Config.TG_BOT_USERNAME, "الاوامر")
    await response[0].click(event.chat_id)
    await event.delete()
"""

"""
@zedub.zed_cmd(pattern=f"الأوامر(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, f"[❖ مـَنظـمة الانينمـَوس ❖ - قائمــة الاوامــر العامــه](t.me/ANENMUS) 𓆪\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**❖ مـرحبـاً عـزيـزي {mention}\n❖  اضغـط ع الامـر لـ النسـخ**\n**⌔ لا تنسى وضـع نقطه (.) بداية كل امـر :**\n\n `.م1`**   ➪ اوامــر البحـث والتحميــل** \n `.م2`**   ➪ اوامــر البــوت**\n `.م3`**   ➪ اوامــر الـوقتــي**\n `.م4`**   ➪ اوامــر المجمــوعــه¹**\n `.م5`**   ➪ اوامــر المجمــوعــه²**\n `.م6`**   ➪ اوامــر الحســاب**\n `.م7`**   ➪ اوامــر الميـديـا والصيــغ**\n `.م8`**   ➪ اوامــر الفــارات**\n `.م9`**   ➪ اوامــر الـخدمــات**\n `.م10`** ➪ اوامــر الالـعــاب**\n `.م11`** ➪ اوامــر التســليـه**\n `.م12`** ➪ اوامــر التحشيـش**\n `.م13`** ➪ اوامــر الستـوريات**\n `.م14`** ➪ اوامــر الآفتــارات**\n `.م15`** ➪ اوامــر الصيـد والتشيكـر**\n `.م16`** ➪ اوامــر النشــر التلقــائي**\n `.م17`** ➪ اوامــر تجميــع النقــاط**\n `.م18`** ➪ اوامــر الاشتــراك الاجبــاري**\n `.م19`** ➪ اوامــر إضـافـة الاعضــاء**\n `.م20`** ➪ اوامــر التفليــش**\n `.م21`** ➪ اوامــر الســوبــرات**\n `.م22`** ➪ اوامــر السبــام والتكــرار**\n `.م23`** ➪ اوامــر المطــور المســاعـد**\n `.م24`** ➪ اوامــر الـذاتيــة**")
@zedub.zed_cmd(pattern=f"اوامري(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, f"[❖ مـَنظـمة الانينمـَوس ❖ - قائمــة الاوامــر العامــه](t.me/ANENMUS) 𓆪\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⌔ مـرحبـاً عـزيـزي {mention}\n⌔  اضغـط ع الامـر لـ النسـخ**\n**⌔ لا تنسى وضـع نقطه (.) بداية كل امـر :**\n\n `.م1`**   ➪ اوامــر البحـث والتحميــل** \n `.م2`**   ➪ اوامــر البــوت**\n `.م3`**   ➪ اوامــر الـوقتــي**\n `.م4`**   ➪ اوامــر المجمــوعــه¹**\n `.م5`**   ➪ اوامــر المجمــوعــه²**\n `.م6`**   ➪ اوامــر الحســاب**\n `.م7`**   ➪ اوامــر الميـديـا والصيــغ**\n `.م8`**   ➪ اوامــر الفــارات**\n `.م9`**   ➪ اوامــر الـخدمــات**\n `.م10`** ➪ اوامــر الالـعــاب**\n `.م11`** ➪ اوامــر التســليـه**\n `.م12`** ➪ اوامــر التحشيـش**\n `.م13`** ➪ اوامــر الستـوريات**\n `.م14`** ➪ اوامــر الآفتــارات**\n `.م15`** ➪ اوامــر الصيـد والتشيكـر**\n `.م16`** ➪ اوامــر النشــر التلقــائي**\n `.م17`** ➪ اوامــر تجميــع النقــاط**\n `.م18`** ➪ اوامــر الاشتــراك الاجبــاري**\n `.م19`** ➪ اوامــر إضـافـة الاعضــاء**\n `.م20`** ➪ اوامــر التفليــش**\n `.م21`** ➪ اوامــر الســوبــرات**\n `.م22`** ➪ اوامــر السبــام والتكــرار**\n `.م23`** ➪ اوامــر المطــور المســاعـد**\n `.م24`** ➪ اوامــر الـذاتيــة**")

@zedub.zed_cmd(pattern="م1(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر البحـث والتحميــل](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n⪼ `.بحث` + اسـم الاغنيـه\n**لـ تحميـل الاغـاني مـن يوتيـوب بدقه خفيفـه وتحميـل اسـرع**\n\n⪼ `.يوت` + كلمـه او بالـرد ع رابـط\n**لـ تحميـل الصوت والفيديـو بعـدة صيـغ مـن اليـوتيـوب بواسطـة لوحـه انلايـن شفافـه**\n\n⪼ `.فيديو` + اسـم المقطـع\n**لـ تحميـل مقـاطع الفيديـو مـن يوتيـوب**\n\n⪼ `.تحميل صوت` + رابـط\n**لـ تحميـل المقـاطع الصـوتيه من يوتيـوب عبر الرابـط**\n\n⪼ `.تحميل فيديو` + رابـط\n**لـ تحميـل مقـاطع الفيـديـو من يوتيـوب عبر الرابـط**\n\n⪼ `.يوتيوب`+ كلمـه\n**لـ البحث عـن روابـط بالكلمـه ع يوتيـوب **\n\n⪼ `.انستا` + رابـط\n**لـ تحميـل الصـور ومقـاطع الفيديـو مـن الانستجـرام**\n\n⪼ `.صور` + كلمـه\n**لـ البحث وتحميـل الصـور من جوجـل بدقـه HD**\n\n⪼ `.ملصقات` + كلمـه\n**لـ البحث عن حـزم ملصقـات على تيليجـرام..**\n\n⪼ `.متحركه` + كلمـه\n**لـ البحث عن صـور متحركـه من جـوجـل..**\n\n⪼ `.تيك` + رابـط او بالـرد ع رابـط\n**لـ تحميـل مقاطـع الفيديـو من تيك توك**\n\n⪼ `.لايكي` + رابـط\n**لـ تحميـل مقاطـع الفيديـو من لايكـي**\n\n⪼ `.فيس` + رابـط او `.فيس` بالـرد ع رابـط\n**لـ تحميـل مقاطـع الفيديـو مـن فيس بـوك**\n\n⪼ `.تويتر` + رابـط\n**لـ تحميـل مقاطـع الفيديـو من تويتـر**\n\n⪼ `.بنترست` + رابـط\n**لـ تحميـل مقاطـع الفيديـو من بنتـرست**\n\n⪼ `.سناب` + رابـط\n**.سناب + رابـط لـ تحميـل مقاطـع الفيديـو من سناب شـات**\n\n⪼ `.ساوند` + رابـط\n**.ساوند + رابـط او بالـرد ع رابـط لـ تحميـل الاغـاني مـن سـاونـد كلـود عـبر الرابـط**\n\n\n**• اوامــر البحث الذكيـه الخاصـه بـ تيليجـرام 🔎 :**\n**خاصه وحصرية ع سـورس زدثــون فقـط**\n\n⪼ `.تلي` + كلمة\n** امـر بحث خاص داخل تيليجـرام  لـ البحث عن قنوات + مجموعات بالكلمـه يعطيك قائمة بالقنوات والمجموعات الموجوده ع التلي**\n\n⪼ `.كلمه` + الكلمة\n** امـر بحث خاص داخل مجموعات تيليجـرام  لـ البحث عن كلمة محدده داخل المجموعة يعطيك قائمة بروابط الرسائل المحتويه ع الكلمة داخل المجموعة**\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪")
@zedub.zed_cmd(pattern="م2(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر البـــوت 🦾🤖](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n⪼ `.اعاده تشغيل`\n**لـ لتـرسيت واعـادة تشغيـل البـوت**\n\n⪼ `.ايقاف البوت`\n**لـ ايقـاف البـوت عـن العمـل والغـاء التنصـيب**\n\n⪼ `.تحديث`\n**لـ البحـث عـن تحديثـات وتحديث البـوت**\n\n⪼ `.تحديث الان`\n**لـ التحـديث الاولـي لـ البـوت لـ التنصيـب الثـانوي**\n\n⪼ `.تحديث البوت`\n**لـ التحـديث الثـانوي لـ البـوت لـ التنصيـب الاولـي والثـانوي**\n\n⪼ `.فحص`\n**لـ فحص قاعدة البيانات وعـرض اصـدار السورس ولغة بايثـون ومكتبة تيليثون**\n\n⪼ `.سليب` او `.سليب_ميديا`\n**لـ جعل البـوت في وضع النـوم او الإسبات ويتم ايقافه عند ارسالك لـ اي رسالة**\n\n⪼ `.الانترنت` او `.الانترنت صورة`\n**لـ عرض سرعة الانتـرنت (الرفـع & التحميـل) في سيرفـر البوت الخاص بك**\n\n⪼ `.المساعد`\n**لـ عـرض قائمـة اوامـر المطـور المسـاعد**\n\n⪼ `.الاذاعه`\n**لـ عـرض اوامـر الاذاعـه والتوجيـه**\n\n⪼ `.النظام`\n**لـ لعـرض معلومـات نظـام البـوت الخـاص بك**\n\n⪼ `.السرعه`\n**لـ قياس سرعة الرفع والتحميل في سيرفر البوت الخاص بك**\n\n⪼ `.فرمته`\n**لـ حذف المجلدات والملفات والعمليات المخزنه مؤقتـاً في سيرفر البوت الخاص بك**\n\n⪼ `.فاراتي`\n**لـ عـرض جميـع فارات تنصيبك**\n\n⪼ `.تاريخ التنصيب`\n**لـ عـرض تاريـخ بـدء تنصيبك على سـورس زدثــون**\n\n**•❐• لعـرض اصـدار السـورس ارسـل** `.سورس`\n**•❐• لعـرض قنـوات السـورس ارسـل** `.زدثون`\n\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪")
@zedub.zed_cmd(pattern="م3(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر الـوقتــي](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n⪼ `.الاسم تلقائي`\n**لوضـع اسـم وقتـي لحسابـك يتغيـر تلقائيـاً كـل دقيقـه مـع الوقـت**\n\n\n⪼ `.البايو تلقائي`\n**لوضـع بايـو وقتـي يتغيـر تلقائـياً مع الوقـت كـل دقيقـه .. اولاً قـم بالـرد ع نـص البايـو بالامـر (.اضف البايو) **\n\n\n⪼ `.البروفايل تلقائي` \n**لوضـع بروفايـل وقتـي يتغيـر تلقائيـاً مع حسابـك كل دقيقـه اولاً قـم بالـرد ع الصـوره بالامـر (.اضف صورة الوقتي)**\n\n\n⪼ `.انهاء الاسم` / `.انهاء البايو` / `.انهاء البروفايل`\n**لـ الغــاء الاوامــر الوقتيــه مـن حســابـك**\n\n\n⪼ `.اوامر الوقتي` \n**لـ عـرض اوامـر زخرفـة الاسـم والبروفـايل الوقتـي**\n\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪")
@zedub.zed_cmd(pattern="م4(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر المجمــوعــه¹](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n⪼ `.البوتات`\n**كشـف وتنظيف مجموعتـك من البوتات .. لمنع التخريب**\n\n⪼ `.قفل البوتات` / `.فتح البوتات`\n**قفـل البوتـات بالطـرد التلقائـي .. الامر يمنع حتى المشـرفين من اضافـة البوتات**\n\n⪼ `.قفل الدردشه` / `.قفل الصور` / `.قفل المتحركه` / `.قفل الملصقات`\n**قفـل الدردشـه / الصـور / المتحركات / الملصقـات بالتقييـد .. الامر يسمـح فقـط لـ المشـرفين**\n\n⪼ `.قفل الاضافه` / `.فتح الاضافه`  \n**قفـل اضافـة الاعضـاء بالطـرد**\n\n⪼ `.قفل الدخول` / `.فتح الدخول `\n**قفـل الدخـول بالرابـط بالطـرد التلقائـي .. حيث يقـوم بطـرد المنضم تلقائيـاً .. مـع ارسـال رسـاله تحذيريـه**\n\n⪼ `.قفل الميديا` \ `.فتح الميديا `\n**قفـل الوسائـط بالمسـح + تقييـد المرسـل من صلاحيـة ارسال الوسائط تلقائيـاً .. مع السمـاح له بارسـال الرسـائل فقـط**\n\n⪼ `.قفل تعديل الميديا` \ `.فتح تعديل الميديا `\n**قفـل تعديـل الوسائـط بالمسـح + تحذيـر المرسـل تلقائيـاً .. يفيدكـم لـ منـع التفليـش**\n\n⪼ `.قفل الفشار` / `.فتح الفشار`\n**لـ مسـح رسـائل الفشار والسب والتكفير تلقائيـاً .. مـع تحذيـر الشخـص المرسـل **\n\n⪼ `.قفل الفارسيه` / `.فتح الفارسيه`\n**لـ مسـح رسـائل الايرانيين وبوتات الاعلانات الفارسيه تلقائيـاً**\n\n⪼ `.قفل الروابط` / `.فتح الروابط`\n**قفـل الروابـط بالمسـح التلقائـي .. مع تحذير الشخص المرسل**\n\n⪼`.قفل المعرفات` / `.فتح المعرفات`\n**قفـل المعرفـات بالمسـح التلقائـي والتحذيـر**\n\n⪼ `.قفل التوجيه` / `.فتح التوجيه`\n**قفـل الرسائل الموجهه من القنوات بالمسـح التلقائـي والتحذيـر**\n\n⪼ `.قفل الانلاين` / `.فتح الانلاين`\n**قفـل رسائل الانلايـن والهمسـات بالمسـح التلقائـي والتحذيـر**\n\n⪼ `.قفل المميز` / `.فتح المميز`\n** لـ قفـل رسائل الايموجي الخاصه بـ مشتركيـن تيليجـرام بريمـيوم**\n\n⪼ `.قفل التفليش` / `.فتح التفليش`\n**لـ قفـل تصفير المجموعة من المشرفين الخونه + يجب ان تكون انت من رفع المشرفين او يجب ان تكون مالك المجموعة**\n\n⪼ `.قفل الكل` / `.فتح الكل`\n**لـ قفـل او فتـح كـل الاوامـر السابقـه**\n\n⪼ `.قيد`\n**لـ تقييـد محتـوى مجمـوعتك او قناتـك + يجب ان تكون مـالك المجموعـة**\n\n⪼ `.الاعدادات`\n**لـ عـرض اعدادات المجمـوعـة**")
@zedub.zed_cmd(pattern="م5(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر المجمــوعــه²](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n⪼ `.الرابط`\n**لـ جـلب رابـط المجمـوعـة + يجب ان تكون مشرفـاً فيهـا**\n\n⪼ `.رسائلي` / `.رسائله`\n**لـ عـرض عـدد رسـائلك او رسائل شخـص بالمجمـوعـة**\n\n⪼ `.حذف رسائلي`\n**لـ حـذف جميـع رسـائلك بالمجمـوعـة**\n\n⪼ `.غادر`\n**لـ مغـادرة المجمـوعـة**\n\n⪼ `.رفع مشرف`\n**لـ رفـع الشخـص مشـرفـاً بالمجمـوعـة**\n\n⪼ `.تنزيل مشرف`\n**لـ تنزيـل الشخـص مـن الاشـراف + يجـب ان تكـون انت من قـام برفعـه مسبقـاً **\n\n⪼ `.رفع مالك`\n**لـ رفـع الشخـص مشـرفـاً بالمجمـوعـة بلقـب مـالك**\n\n⪼ `.الاعدادات`\n**لـ عـرض اعـدادات المجمـوعـة**\n\n\n⪼ `.تاك` / `.all` \n**الامـر + كلمـه او بالـرد ع رسـالـه لـ عمـل تـاك بشكـل متقطـع لـ الكـل بالمجمـوعـة**\n\n⪼ `.ايقاف التاك`\n**لـ إيقـاف التـاك**\n\n\n⪼ `.احصائياتي`\n**لـ عـرض قائمـة بـ إحصـائيات دردشـات حسـابك**\n\n⪼ `.كروباتي الكل` / `.كروباتي ادمن` / `.كروباتي مالك` \n**لـ عـرض قائمـة بمعلومـات كروباتك**\n\n⪼ `.قنواتي الكل` / `.قنواتي ادمن` / `.قنواتي مالك`\n**لـ عـرض قائمـة بمعلومـات قنواتـك**\n\n⪼ `.الاعضاء` / `.المشرفين` \n**.الاعضاء / .المشرفين + معرف او رابـط المجمـوعـة لـ عـرض قائمـة او ملـف بـ اعضـاء / او مشرفيـن المجمـوعـة**\n\n⪼ `.البوتات`\n**.البوتات + معرف او رابـط المجمـوعـة لـ عـرض قائمـة بـ بوتـات المجمـوعـة**\n\n⪼ `.المحذوفين`\n**.المحذوفين او .المحذوفين تنظيف لـ عـرض او تنظيـف المجمـوعـة من الحسـابات المحذوفـه**\n\n⪼ `.مسح المحظورين`\n**لـ مسـح محظـورين المجمـوعـة**\n\n\n⪼ `.ضيف`\n**.ضيف + رابط المجموعـه لـ اضـافة الاعضـاء استخـدم الامـر بالمجمـوعـة الهـدف مع اضافه رابط كروبك لـ الامـر**\n\n⪼ `.تفليش`\n**لـ تفليـش جميـع اعضـاء مجمـوعـه معينـه**\n\n⪼ `.تصفير`\n**لـ تفليـش جميـع اعضـاء قنـاة معينـه**\n\n⪼ `.الصورة وضع` / `.الصورة حذف` \n**لـ وضـع / حـذف صـورة المجمـوعـة**\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪")
@zedub.zed_cmd(pattern="م6(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر الحســاب 🚹](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n⪼ `.ضع اسم` | `.ضع بايو` | `.ضع يوزر` | `.ضع صورة`\n**.الامـر بالـرد او + نـص لـ تغييـر اسـم او بايـو او صـورة حسابـك**\n\n⪼ `.ايدي` او `.ا`\n**.ايدي بالـرد او + معـرف/ايـدي الشخص لـ عـرض معلومـات الشخـص**\n\n⪼ `.الايدي`\n**.الايدي بالـرد لـ جلـب ايـدي الشخـص والمجمـوعـة**\n\n⪼ `.حزمة`\n**.صورته بالـرد / .صورته الكل بالـرد لـ جـلب جميـع بروفـايلات الشخـص**\n\n⪼ `.اسمي` / `.اسمه`\n**.اسمه بالـرد لـ جـلب اسـم الشخـص**\n\n⪼ `.الاسماء`\n**.الاسماء بالـرد / .الاسماء + معـرف او ايدي الشخـص لـ جـلب قائمـة بسجـل اسمـاء حسـاب الشخـص**\n\n⪼ `.المعرفات`\n**.المعرفات بالـرد / .المعرفات + معـرف او ايدي الشخـص لـ جـلب قائمـة بسجـل معـرفـات حسـاب الشخـص**\n\n⪼ `.تخزين الخاص تفعيل`\n**الامـر + تفعيل او تعطيل لـ تخـزين جميـع رسـائل الخـاص بـ كـروب التخـزين**\n\n⪼ `.تخزين الكروبات تفعيل`\n**الامـر + تفعيل او تعطيل لـ تخـزين جميـع تاكـات المجمـوعـةات بـ كـروب التخـزين**\n\n\n**- اوامــر حمـايــة الخــاص🛡 :**\n\n⪼ `.الحمايه تفعيل`\n**لـ تفعيـل حمايـة الخـاص لـ حسـابك**\n\n⪼ `.الحمايه تعطيل`\n**لـ تعطيـل حمايـة الخـاص لـ حسـابك**\n\n⪼ `.قبول`\n**لـ السمـاح لـ الشخـص بـ ارسـال رسـائل الخـاص اثنـاء تفعيـل حمـاية الخـاص بحسـابك بـدون تحـذير**\n\n⪼ `.رفض`\n**لـ رفـض الشخـص من ارسـال رسـائل الخـاص اثنـاء تفعيـل حمـاية الخـاص بحسـابك**\n\n⪼ `.مرفوض`\n**لـ حظـر الشخـص من الخـاص دون تحـذير**\n\n⪼ `.المقبولين`\n**لـ عـرض قائمـة بالاشخـاص المقبـولين**\n\n\n**- اوامــر الحظــر - الكتــم - الطــرد 🔕 :**\n\n⪼ `.حظر`  /  `.الغاء حظر`\n\n⪼ `.كتم`  /  `.الغاء كتم`\n\n⪼ `.طرد`\n\n⪼ `.ح عام`\n\n⪼ `.الغاء ح عام`\n\n⪼ `.ك عام`\n\n⪼ `.الغاء ك عام`\n\n⪼ `.ط عام`\n\n⪼ `.الحاظرهم`\n**لـ جلب قائمـه بالاشخاص المحظورين خاص**\n\n⪼ `.رسائلي` / `.رسائله`\n**لـ عـرض عـدد رسائلك او رسائل شخص في المجمـوعـة**\n\n⪼ `.حذف رسائلي` + عـدد\n**لـ حـذف رسائلك من المجمـوعـة**\n\n⪼ `.احذف` + معـرف\n**لـ حذف دردشـة مع شخص من الخاص**")
@zedub.zed_cmd(pattern="م7(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر الميــديـا والصيــغ](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n⪼ `.ملصق`\n**.ملصق بالـرد ع صـوره او فيديـو لـ صنـع ملصـق او ملصـق فيديـو متحـرك**\n\n⪼ `.حزمه`\n**.حزمه بالـرد ع ملصـق لـ تفكيـك حزمـة ملصـق مـا وصنعهـا بحقوقـك**\n\n⪼ `.حزمة`\n**.حزمة + اسـم بالـرد ع ملصـق لـ تفكيـك حزمـة ملصـق مـا وصنعهـا بحقـوق الاسـم الـذي ادخلتـه**\n\n⪼ `.معلومات الملصق`\n**الامـر بالـرد ع ملصـق لـ جـلب معلومـات حزمـة الملصـق**\n\n⪼ `.ملصقات`\n**الامـر + اسـم لـ البحـث عن حـزم ملصقـات بـ الاسـم**\n\n\n⪼ `.لملصق`\n**الامـر بالـرد ع صـوره لـ تحويـل الصـوره لـ ملصـق**\n\n⪼ `.لصوره`\n**الامـر بالـرد ع ملصـق لـ تحويـل الملصـق لـ صـوره**\n\n⪼ `.لفيد`\n**الامـر بالـرد ع صـوره او ملصـق لـ تحويـلهـا لـ تصميـم فيديـو **\n\n⪼ `.دائري`\n**الامـر بالـرد ع صـوره او ملصـق او فيديـو او متحركـه لـ تحويـلهـا لـ تصميـم فيديـو دائـري**\n\n⪼ `.لمتحركة`\n**الامـر بالـرد ع ملصـق متحـرك لـ تحويـله لـ متحـركـه**\n\n⪼ `.حول بصمه`\n**الامـر بالـرد ع فيديـو لـ استخـراج الصـوت كـ تسجيل صوت بصمه**\n\n⪼ `.حول صوت`\n** الامـر بالـرد ع فيديـو لـ استخـراج الصـوت كـ ملـف صوت MP3**\n\n⪼ `.لمتحركه`\n** الامـر بالـرد ع صـوره او ملصـق لـ تحويـلهـا الـى متحـركـه**\n\n⪼ `.لمتحرك`\n** الامـر بالـرد ع فيديـو لـ تحويـله الـى متحـركـه**\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪")
@zedub.zed_cmd(pattern="م8(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر الـفــارات 🎛](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎قائـمه اوامر تغييـر فـارات الصـور بأمـر واحـد فقـط - لـ اول مـره ع سـورس تليثـون يوزر بـوت 🦾 :** \n\n⪼ `.اضف صورة الحماية` بالـرد ع صـورة او ميديـا\n\n⪼ `.اضف صورة الفحص` بالـرد ع صـورة او ميديـا\n⪼ قنـاة كلايـش الفحـص @zzclll\n\n⪼ `.اضف صورة الوقتي` بالـرد ع صـورة او ميديـا\n\n⪼ `.اضف صورة الاوامر` بالـرد ع صـورة او ميديـا\n\n⪼ `.اضف صورة السورس` بالـرد ع صـورة او ميديـا\n\n⪼ `.اضف صورة الكتم` بالـرد ع صـورة او ميديـا\n\n⪼ `.اضف صورة البوت` بالـرد ع صـورة او ميديـا لـ اضـافة صـورة ستـارت للبـوت\n\n⪼ `.اوامر الفارات` لعـرض بقيـة اوامـر الفـارات\n\n\n**⎉╎قائـمه اوامر تغييـر كليشـة الايـدي :** \n\n⪼ `.اضف فار ايموجي الايدي` بالـرد ع الرمـز او الايموجـي\n\n⪼ `.اضف فار عنوان الايدي` بالـرد ع نـص العنـوان\n\n⪼ `.اضف فار خط الايدي` بالـرد ع الخـط او المستقيـم\n\n⪼ `.اضف كليشة الايدي` بالـرد ع الكليشـه مـن القنـاة @zziddd \n\n\n**⎉╎قائـمه اوامر تغييـر بقيـة الفـارات بأمـر واحـد فقـط :** \n\n⪼ `.اضف فار كليشة الحماية` بالـرد ع الكليشـة\n⪼ قنـاة كلايـش حمايـة الخـاص @zzkrr\n\n⪼ `.اضف فار كليشة الفحص` بالـرد ع الكليشـة\n⪼ قنـاة كلايـش الفحـص @zzclll\n\n⪼ `.اضف فار كليشة الحظر` بالـرد ع الكليشـة\n\n⪼ `.اضف فار كليشة البوت` بالـرد ع الكليشـة لـ اضـافة كليشـة ستـارت\n\n⪼ `.اضف فار رمز الوقتي` بالـرد ع رمـز\n\n⪼ `.اضف فار زخرفة الوقتي` بالـرد ع ارقـام الزغـرفه\n\n⪼ `.اضف فار البايو الوقتي` بالـرد ع البـايـو\n\n⪼ `.اضف فار اسم المستخدم` بالـرد ع اسـم\n\n⪼ `.اضف فار كروب الرسائل` بالـرد ع ايدي الكـروب\n\n⪼ `.اضف فار كروب السجل` بالـرد ع ايدي الكـروب\n\n⪼ `.اضف فار ايديي` بالـرد ع ايدي حسـابك\n\n⪼ `.اضف فار نقطة الاوامر` بالـرد ع الـرمز الجديـد\n\n⪼ `.اضف فار نوم الترحيب` بالـرد ع رقـم الساعة لبداية نوم الترحيب المؤقت\n\n⪼ `.اضف فار رسائل الحماية` بالـرد ع رقـم لعدد رسائل تحذيـرات حماية الخاص\n\n\n⪼ `.جلب فار` + اسـم الفـار\n\n⪼ `.حذف فار` + اسـم الفـار\n\n⪼ `.رفع مطور` بالـرد ع الشخـص لرفعـه مطـور تحكـم كامـل بالاوامـر\n\n⪼ `.حذف فار المطورين`\n\n**⎉╎قائـمه اوامر تغييـر المنطقـة الزمنيـة للوقـت 🌐:** \n\n⪼ `.وقت العراق` \n\n⪼ `.وقت مصر` \n\n⪼ `.وقت الامارات` \n\n⪼ `.وقت ايران` \n\n⪼ `.وقت الجزائر` \n\n⪼ `.وقت المغرب` \n\n⪼ `.وقت تركيا`\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪")
@zedub.zed_cmd(pattern="م9(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر الـخدمــات العـامــه 🎡](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n⪼ `.مساعده`\n\n⪼ `.اوامر الفارات`\n\n⪼ `.اوامر السوبر`\n\n⪼ `.اوامر النشر`\n\n⪼ `.الترحيب`\n\n⪼ `.الردود`\n\n⪼ `.الاذاعه`\n\n⪼ `.التكرار`\n\n⪼ `.المساعد`\n\n⪼ `.الطقس`\n\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪")
@zedub.zed_cmd(pattern="م10(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - قائمــة اوامــر الالـعــاب 🎮🎳](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n⪼ `.بلاي` \n**- قائمــة العــاب الانـلايـن لســورس زدثـــون 🕹**\n\n⪼ `.كت`\n**- اسئلـة كـت تـويت ⁉️**\n\n⪼ `.احكام`\n**- لعبــة احكــام الشهيــرة ⚖👩🏻‍⚖**\n\n⪼ `.عقاب`\n**- لعبــة عقــاب ⛓**\n\n⪼ `.اكس او`\n**- لعبــة اكـس او 🧩**\n\n⪼ `.نرد`\n**- لعبــة رمـي النــرد 🎲**\n\n⪼ `.سهم`\n**- لعبــة رمـي السهــم 🎯**\n\n⪼ `.سله`\n**- لعبــة كــرة السلــة 🏀**\n\n⪼ `.كرة`\n**- لعبــة كــرة القــدم ⚽️**\n\n⪼ `.حظ`\n**- لعبــة الحــظ 🎰**\n\n⪼ `.خيرني`\n**- لعبــة لـو خيـروك بالصـور ⁉️🌉**\n\n⪼ `.تويت`\n**- لعبــة كـت تـويت بالصـور ⁉️🌁**\n\n\n**- سيتـم اضـافــة المـزيــد من الالعــاب بالتحديثــات الجــايـه 🎭**\n\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪")
@zedub.zed_cmd(pattern="م11(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - قائمــة اوامــر التسـليــه 🏂](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n⪼ `.تسليه1`\n⪼ `.تسليه2`\n⪼ `.تسليه3`\n⪼ `.تسليه4`\n⪼ `.تسليه5`\n⪼ `.تسليه6`\n⪼ `.تسليه7`\n⪼ `.تسليه8`\n⪼ `.تسليه9`\n⪼ `.تسليه10`\n\n**⎉╎قائـمه اوامــر التسـليـه الجـديـده حقـوق سـورس زدثـــون :**\n\n⪼ `.حيوان` بالـرد\n\n⪼ `.زاحف` بالـرد\n\n⪼ `.مشهور` بالـرد\n\n⪼ `.مشهوره` بالـرد\n\n⪼ `.التحشيش`\n\n⪼ `.معاني` + اسـم\n\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪")
@zedub.zed_cmd(pattern="م12(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - قائمــة اوامــر التحشيـش 🎃](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**- اضغـط ع الامـر للنسـخ ثـم قـم بالـرد ع الشخـص**\n\n⪼ `.اوصف`  /  `.هينه` \n⪼ `.نسبه الحب`\n⪼ `.نسبه الانوثه`\n⪼ `.نسبه الغباء`\n⪼ `.نسبه النجاح`\n⪼ `.نسبه الانحراف`\n⪼ `.نسبه المثليه`\n⪼ `.نسبه الكراهيه`\n\n⪼ `.رفع تاج`  /  `.رفع بقلبي`\n⪼ `.رفع صاك`  /  `.رفع صاكه`\n⪼ `.رفع حات`  /  `.رفع حاته`\n⪼ `.رفع ورع`  /  `.رفع مزه`\n⪼ `.رفع مرتي`  /  `.رفع خطيبتي` \n⪼ `.رفع مطي`  /  `.رفع حمار`  /  `.رفع جلب`\n⪼ `.رفع حيوان`  /  `.رفع خروف` \n⪼ `.رفع بزون`  /  `.رفع جريذي`\n⪼ `.رفع فرخ`  /  `.رفع زباله`\n⪼ `.زاحف`  /  `.رفع جلب`\n⪼ `.رفع مرتبط`  /  `.رفع مرتبطه`\n⪼ `.رفع حبيبي`\n⪼ `.رفع مدير`  /  `.رفع منشئ`\n\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪")
@zedub.zed_cmd(pattern="م13(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر الستـوريـات 🎆🏖](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n⪼ `.حالات واتس`\n**- اكثـر مـن 2000 فيديـو حالات واتسـاب قصيـرة 🎬**\n\n⪼`.ستوري انمي`\n**- مقاطـع ستوريـات انمـي قصيـرة 🎞**\n\n⪼ `.ادت`\n**- مقاطـع ادت منـوعـة 🎥**\n\n⪼ `.رياكشن`\n**- مقاطـع رياكشـن ترفيهيــه 📺**\n\n⪼ `.ميمز`\n**- بصمـات ميمـز تحشيـش 🎃**\n\n⪼ `.غنيلي`\n**- مقاطـع اغـانـي قصيـره 🎶**\n\n⪼ `.شعر`\n**- مقاطـع صـوت شعـريـه 🎙**\n\n⪼ `.رقيه`\n**- رقيـه شرعيـة لعـدة مشائـخ 🕋**\n\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪")
@zedub.zed_cmd(pattern="م14(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر الآفتـــارات والصــور 🎆🏖](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n⪼ `.ولد انمي`\n**- اكثـر مـن 2500 آفتـار آنمـي شبـاب 🙋🏻‍♂🎆**\n\n⪼`.بنت انمي`\n**- اكثـر مـن 1800 آفتـار آنمـي بنـات 🙋🏻‍♀🎆**\n\n⪼ `.رمادي`\n**- آفتـارات شبـاب رمـاديـه 🏂🏙**\n\n⪼ `.رماديه`\n**- آفتـارات بنـات رمـاديـه ⛹🏻‍♀🌁**\n\n⪼ `.بيست`\n**- آفتـارات بيست تطقيـم بنـات 👯‍♀🏖**\n\n⪼ `.حب`\n**- آفتـارات بيست تطقيـم حب ♥️🧚‍♂🧚‍♀**\n\n⪼ `.بنات`\n**- اكثـر مـن 2500 آفتـارات بنـات تمبلـر 💅🎆**\n\n⪼ `.ري اكشن`\n**- صـور رياكشـن تحشيـش 🎃😹**\n\n⪼ `.معلومه`\n**- صـوره ومعلومـه معلومـات عـامـه 🗺**\n\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪")
@zedub.zed_cmd(pattern="م15(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر الصيـد & التشيكـر ❇️](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**✾╎اولاً قـائمـة اوامـر تشيكـر صيـد معـرفات تيليجـرام :** \n\n`.النوع`\n**⪼ لـ عـرض الانـوع التي يمكـن صيدهـا مع الامثـله**\n`.صيد` + النـوع\n**⪼ لـ صيـد يـوزرات عشوائيـه على حسب النـوع**\n`.حالة الصيد`\n**⪼ لـ معرفـة حالـة تقـدم عمليـة الصيـد**\n`.صيد ايقاف`\n**⪼ لـ إيقـاف عمليـة الصيـد الجاريـه**\n\n\n**✾╎ثانياً قـائمـة اوامـر تشيكـر تثبيت معـرفات تيليجـرام :** \n\n`.تثبيت_قناة` + اليوزر\n**⪼ لـ تثبيت اليـوزر بقنـاة معينـه اذا اصبح متاحـاً يتم اخـذه**\n`.تثبيت_حساب` + اليوزر\n**⪼ لـ تثبيت اليـوزر بحسـابك مباشـرة اذا اصبح متاحـاً يتم اخـذه**\n`.تثبيت_بوت` + اليوزر\n**⪼ لـ تثبيت اليـوزر في بـوت فـاذر اذا اصبح متاحـاً يتم اخـذه**\n\n`.حالة تثبيت_القناة`\n**⪼ لـ معرفـة حالـة تقـدم التثبيت التلقـائـي على القنـاة**\n`.حالة تثبيت_الحساب`\n**⪼ لـ معرفـة حالـة تقـدم التثبيت التلقـائـي على حسابـك**\n`.حالة تثبيت_البوت`\n**⪼ لـ معرفـة حالـة تقـدم التثبيت التلقـائـي على بـوت فـاذر**\n\n`.ايقاف تثبيت_القناة`\n**⪼ لـ إيقـاف عمليـة تثبيت_القناة التلقـائـي**\n`.ايقاف تثبيت_الحساب`\n**⪼ لـ إيقـاف عمليـة تثبيت_الحساب التلقـائـي**\n`.ايقاف تثبيت_البوت`\n**⪼ لـ إيقـاف عمليـة تثبيت_البوت التلقـائـي**\n\n\n**- ملاحظـات مهمـه قبـل استخـدام اوامـر الصيـد والتثبيت :**\n**⪼** تأكد من ان حسابك يوجد فيه مساحه لانشاء قناة عامة (قناة بمعرف)\n**⪼** اذا كان لا يوجد مساحه لانشاء قناة عامة قم بارسال يوزر اي قناة من قنوات حسابك وبالرد ع يوزرها ارسل احد اوامر الصيد\n**⪼** لا تقم بـ ايقاف الصيد حتى ولو استمر الصيد ايام\n**⪼** تحلى بالصبر وكرر محاولات الصيد حتى تصيد يوزر\n**⪼** كل نوع من اليوزرات يختلف عن الاخر من حيث نسبة الصيد\n**⪼ التثبيت هو تثبيت يوزر محدد حتى ماينسرق منك عندما يصير متاح**\n\n**- انضـم للقنـاة ~ @RRRDB**\n**⪼ لـ رؤيـة بعـض اليـوزرات التي قام بصيدهـا منصبيـن زدثــون**\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪")
@zedub.zed_cmd(pattern="م16(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر النشــر التلقــائي 🌐](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎قـائمـة اوامـر النشـر التلقـائي الخاص بسـورس زدثـــون🦾 :**\n\n**- هي عبارة عن فكـرة تسمح لـ البوت الموجود بحسابك بنشـر منشورات تلقائيـه بقناتك من قناة انت تحددهـا** \n\n\n⪼`.تلقائي`\n**⪼ الامـر + (معـرف/ايـدي/رابـط) القنـاة المـراد النشـر التلقـائي منهـا .. استخـدم الامـر داخـل قناتك✓**\n\n⪼ `.ستوب`\n**⪼ الامـر + (معـرف/ايـدي/رابـط) القنـاة المـراد ايقـاف النشـر التلقـائي منهـا .. استخـدم الامـر داخـل قناتك ✓**\n\n\n**- ملاحظـه 🧧:**\n**- الاوامـر صـارت تدعـم القنـوات الخاصه ايضـاً والمعـرفات والروابـط ايضاً الى جـانب الايـدي .. ع عكس بقية السورسات 🏂🎗**\n**🛃 سيتـم اضـافة المزيـد من اوامــر النشـر التلقـائي بالتحديثـات الجـايه**\n\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪")
@zedub.zed_cmd(pattern="م17(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر تجميــع النقــاط 🛂](t.me/ANENMUS) .\n**⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆**\n**⎉╎اوامـر تجميـع نقـاط تمـويـل الخاصـه بسـورس زدثـــون ♾ :**\n\n`.المليار`  /  `.ايقاف المليار`\n**⪼ لـ تجميـع النقـاط مـن بـوت ( @EEOBot ) .. تلقـائيـاً ✓**\n\n`.العرب`  /  `.ايقاف العرب`\n**⪼ لـ تجميـع النقـاط مـن بـوت ( @xnsex21bot ) .. تلقـائيـاً ✓**\n\n`.الجوكر`  /  `.ايقاف الجوكر`\n**⪼ لـ تجميـع النقـاط مـن بـوت ( @A_MAN9300BOT ) .. تلقـائيـاً ✓**\n\n`.العقاب`  /  `.ايقاف العقاب`\n**⪼ لـ تجميـع النقـاط مـن بـوت ( @MARKTEBOT ) .. تلقـائيـاً ✓**\n\n`.المليون`  /  `.ايقاف المليون`\n**⪼ لـ تجميـع النقـاط مـن بـوت ( @qweqwe1919bot ) .. تلقـائيـاً ✓**\n\n`.برليون`  /  `.ايقاف برليون`\n**⪼ لـ تجميـع النقـاط مـن بـوت ( @Burllionbot ) .. تلقـائيـاً ✓**\n\n`.تناهيد`  /  `.ايقاف تناهيد`\n**⪼ لـ تجميـع النقـاط مـن بـوت ( @Ncoe_bot ) .. تلقـائيـاً ✓**\n\n`.اليمن`  /  `.ايقاف اليمن`\n**⪼ لـ تجميـع النقـاط مـن بـوت ( @srwry2bot ) .. تلقـائيـاً ✓**\n\n`.مهدويون`  /  `.ايقاف مهدويون`\n**⪼ لـ تجميـع النقـاط مـن بـوت ( @MHDN313bot ) .. تلقـائيـاً ✓**\n\n\nٴ┄─┄─┄─┄┄─┄─┄─┄─┄┄\n\n**⎉╎قـائمـة بوتـات تمـويـل آخـرى تختلف عن البقيـه ♾ :** \n\n`.دعمكم`  /  `.ايقاف دعمكم`\n**⪼ لـ تجميـع النقـاط مـن بـوت ( @xDamKomBot ) .. تلقـائيـاً ✓**\n\n`.هايبر`  /  `.ايقاف هايبر`\n**⪼ لـ تجميـع النقـاط مـن بـوت ( @ihyberbot ) .. تلقـائيـاً ✓**\n\n`.تجميع`  /  `.ايقاف تجميع`\n**⪼ لـ تجميـع النقـاط مـن البـوت المضاف لـ الفـارات .. تلقـائيـاً ✓**\n\n`.بوت التجميع`\n**⪼ لـ عـرض بوت التجميـع المضـاف لـ الفـارات ..**\n\nٴ┄─┄─┄─┄┄─┄─┄─┄─┄┄\n\n**⎉╎قـائمـة اوامــر اضافـات التجميـع الجديـدة حصريـاً ♾ :** \n\n`.لانهائي المليار` / `.لانهائي الجوكر` / `.لانهائي العقاب` / `.لانهائي العرب` / `.لانهائي المليون` / `.لانهائي برليون` / `.لانهائي تناهيد` / `.لانهائي اليمن`\n**⪼ لـ تجميـع النقـاط مـن البـوت بـدون تـوقـف (لانهـائـي ♾) .. تلقـائيـاً ✓**\n\n`.هدية المليار` / `.هدية الجوكر` / `.هدية العقاب` / `.هدية دعمكم` / `.هدية العرب` / `.هدية المليون` / `.هدية هايبر` / `.هدية برليون` / `.هدية تناهيد` / `.هدية اليمن` / `.هدية مهدويون`\n**⪼ لـ تجميـع نقـاط الهديـة اليوميـة مـن البـوتات ..**\n\n`.نقاط المليار` / `.نقاط الجوكر` / `.نقاط العقاب` / `.نقاط دعمكم` / `.نقاط العرب` / `.نقاط المليون` / `.نقاط هايبر` / `.نقاط برليون` / `.نقاط تناهيد` / `.نقاط اليمن` / `.نقاط مهدويون`\n**⪼ لـ عـرض ومعرفـة عـدد النقـاط فـي البـوت ..**\n\n`.تحويل المليار` / `.تحويل الجوكر` / `.تحويل العقاب` / `.تحويل العرب` / `.تحويل المليون` / `.تحويل هايبر` / `.تحويل برليون` / `.تحويل تناهيد` / `.تحويل اليمن` / `.تحويل مهدويون`\n**⪼ الامـر + عـدد النقـاط لـ الشخـص المـراد تحويـل النقـاط اليـه**\n**⪼ لـ تحويـل النقـاط مـن حسابـك في البـوت الى شخـص عبـر عـدد النقـاط ..**\n\n`.تحويل دعمكم`\n**⪼ الامـر + ايـدي الشخـص + عـدد النقـاط لـ الشخـص المـراد تحويـل النقـاط اليـه**\n\n`.كود دعمكم` / `.كود هايبر`\n**⪼ الامـر + الكـود المـراد فحصـه**\n**⪼ لـ كشـط الكـود والحصـول علـى نقـاط الكـود .. تلقـائيـاً ✓**\n\n\n**- مـلاحظــه :**\n- سيتم اضـافـه المزيـد من المميـزات بالتحديثـات الجايـه ...\n\n𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪")
@zedub.zed_cmd(pattern="م18(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر الاشتــراك الاجبــاري 🛗](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎قـائمـة اوامـر الاشتـراك الاجبـاري الخاص بسـورس زدثـــون🦾 :**\n\n**- اولاً اوامـر اضافـة القنـاة المطلوبـه للفـارات :**\n\n⪼ `.ضع اشتراك الخاص` / `.وضع اشتراك الخاص`\n**⪼ لـ اضافة قناة اشتراك الخاص للفارات .. استخدم الامر + معرف القناة او الامـر فقـط داخل القناة ✓**\n\n⪼ `.ضع اشتراك الكروب` / `.وضع اشتراك الكروب`\n**⪼ لـ اضافة قناة اشتراك الكروب للفارات .. استخدم الامـر + معرف القناة داخل الكروب ✓**\n\n\n**- ثانيـاً اوامـر تفعيـل الاشتـراك بعـد اضافة القنـاة :**\n\n⪼`.تفعيل اشتراك الخاص`\n**⪼ لـ تفعيـل الاشتـراك الاجبـاري للخـاص بعـد اضافة القنـاة ✓**\n\n**⪼ لـ تفعيـل الاشتـراك الاجبـاري للكروب مايحتاج امـر .. اول ماتضيف القناة يتفعل الاشتراك تلقائي ✓**\n\n\n**- ثالثـاً اوامـر تعطيـل الاشتــراك :**\n\n⪼ `.تعطيل اشتراك الخاص`\n**⪼ لـ تعطيـل الاشتـراك الاجبـاري للخـاص اذا كـان مفعـل ✓**\n\n⪼ `.تعطيل اشتراك الكروب`\n**⪼ لـ تعطيـل الاشتـراك الاجبـاري للكـروب اذا كـان مفعـل ✓**\n\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪")
@zedub.zed_cmd(pattern="م19(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر إضـافـة الاعضـاء 🪬](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎قـائمـة اوامـر اضـافة الاعضـاء الخاص بسـورس زدثـــون🦾 :**\n\n⪼ `.ضيف`\n**⪼ .ضيف + رابط المجموعـه لـ اضـافة الاعضـاء استخـدم الامـر بالمجمـوعـة الهـدف مع اضافه رابط كروبك لـ الامـر ✓**\n\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪")
@zedub.zed_cmd(pattern="م20(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر التفليــش ⚠️](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎قـائمـة اوامـر تفليـش الكروبـات الخاص بسـورس زدثـــون🦾 :**\n\n⪼ `.تفليش`\n**⪼ لـ تفليـش جميـع اعضـاء مجمـوعـه معينـه .. استخـدم الامـر داخـل المجمـوعـة + تحتـاج رتبـة مشـرف بالمجمـوعـة ✓**\n\n⪼`.تفليش بالطرد`\n**لـ تفليـش جميـع اعضـاء مجمـوعـه معينـه بالطـرد فقـط وليس بالحظـر .. استخـدم الامـر داخـل المجمـوعـة + تحتـاج رتبـة مشـرف بالمجمـوعـة ✓**\n\n⪼ `.حظر_الكل`\n**⪼ حظـر وتفليـش اعضـاء الكروب عبر بوت الحماية المرفوع بالكروب + ماتحتاج اشراف انت فقط تحتاج رتبه ادمن ومافوق بالبوت ✓**\n\n⪼ `.طرد_الكل`\n**⪼ طـرد وتفليـش اعضـاء الكروب عبر بوت الحماية المرفوع بالكروب + ماتحتاج اشراف انت فقط تحتاج رتبه ادمن ومافوق بالبوت ✓**\n\n⪼ `.كتم_الكل`\n**⪼ كتـم اعضـاء الكروب عبر بوت الحماية المرفوع بالكروب + ماتحتاج اشراف انت فقط تحتاج رتبه ادمن ومافوق بالبوت ✓**\n\n⪼ `.الغاء التفليش`\n**⪼ لـ الغـاء عمليـة التفليـش او الكتـم الجاريـه وايقافهـا ✓**\n\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪")
@zedub.zed_cmd(pattern="م21(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - (اوامــر النشــر العـام (السـوبــرات 🎡](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎قـائمـة اوامـر السـوبـر (النشـر العـام) الخاصـه بـ سـورس زدثـــون ♾ :**\n\n`.سوبر`\n**⪼ الامـر + عـدد الثـوانـي + عـدد مـرات التكـرار (بالـرد ع رسـالة او ميديـا)**\n**⪼ لـ النشـر التكـراري العـام بكـل مجموعـات قائمـة السـوبـر ( خـاص بجماعـة بالسـوبـرات ) ...✓**\n\nٴ┄─┄─┄─┄┄─┄─┄─┄─┄┄\n\n`.ايقاف سوبر`\n**⪼ استخـدم الامـر داخـل المجموعـة المحـدده ...**\n**⪼ لـ إيقـاف النشـر العـام عـن مجموعـة معينـه ...✓**\n\nٴ┄─┄─┄─┄┄─┄─┄─┄─┄┄\n\n`.ايقاف السوبرات`\n**⪼ لـ إيقـاف النشـر التكـراري العـام عـن جميـع المجموعـات ...✓**\n\nٴ┄─┄─┄─┄┄─┄─┄─┄─┄┄\n\n`.اضف سوبر`\n**⪼ استخـدم الامـر داخـل المجموعـة المحـدده ...**\n**⪼ لـ اضافة مجموعـة محـددة لـ قائمـة مجموعـات السوبـر ...✓**\n\nٴ┄─┄─┄─┄┄─┄─┄─┄─┄┄\n\n`.حذف سوبر`\n**⪼ استخـدم الامـر داخـل المجموعـة المحـدده ...**\n**⪼ لـ حـذف مجموعـة محـددة مـن قائمـة مجموعـات السوبـر ...✓**\n\nٴ┄─┄─┄─┄┄─┄─┄─┄─┄┄\n\n`.السوبرات`\n**⪼ لـ جلب قائمـة مجموعـات السوبـر الخاصـه بك ...✓**\n\nٴ┄─┄─┄─┄┄─┄─┄─┄─┄┄\n\n`.حذف السوبرات`\n**⪼ لـ حـذف وتصفيـر قائمـة مجموعـات السوبـر الخاصـه بك ...✓**\n\nٴ┄─┄─┄─┄┄─┄─┄─┄─┄┄\n\n**⪼ مـلاحظــات هـامــه :**\n- اوامـر السوبـرات إضـافة جديـدة خاصـه وحصريـه بسـورس زدثــون¹ فقـط ...\n- تحديثات السوبـر متواصـلة لـ إضـافة كـل ماهـو جديـد بالتحديثـات الجايـه ...\n- نسعـى جاهـدين لـ جعـل اوامـر السوبـر سهـله وسلسـه لـكي توفـر لكـم الجهـد والتعب ...\n- شكـر خـاص لـ منصبيـن السـورس علـى افكـارهم الرائعـه والمفيـده ...\n\n𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪")
@zedub.zed_cmd(pattern="م22(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر السبــام والتكــرار](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n`.كرر` + عـدد + كلمـه\n**⪼ لـ تكـرار كلمـه معينـه لعـدد معيـن من المـرات**\n\n`.مكرر` + الوقت بالثواني + العدد + النص\n**⪼ لـ تكـرار نص لوقت معين وعدد معين من المـرات**\n**⪼ الامر يفيد جماعة الاعلانات وكروبات الشراء**\n\n`.تكرار ملصق`\n**⪼ لـ تكـرار ملصقـات من حزمـه معينـه**\n\n`.سبام` + كلمـه\n**⪼ لـ تكـرار كلمـة او جملـة نصيـه**\n\n`.وسبام` + كلمـه\n**⪼ لـ تكـرار حـروف كلمـة على حرف حرف**\n\n`.تعبير مكرر`\n**⪼ لـ تكـرار تفاعـلات رياكشـن** 👍👎❤🔥🥰👏😁🤔🤯😱🤬😢🎉🤩🤮💩\n\n`.ايقاف التكرار`\n**⪼ لـ إيقـاف أي تكـرار جـاري تنفيـذه**\n\n𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪")
@zedub.zed_cmd(pattern="م23(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر المطـور المســاعـد 🧑🏻‍💻](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n **⎉╎قائـمـه اوامـر رفـع المطـور المسـاعـد 🧑🏻‍💻✅ 🦾 :** \n**- اضغـط ع الامـر للنسـخ ثـم استخـدمهـا بالتـرتيـب** \n\n**⪼** `.رفع مطور` \n**- لـ رفـع الشخـص مطـور مسـاعـد معـك بالبـوت** \n\n**⪼** `.تنزيل مطور` \n**- لـ تنزيـل الشخـص مطـور مسـاعـد مـن البـوت** \n\n**⪼** `.المطورين` \n**- لـ عـرض قائمـة بمطـورين البـوت الخـاص بـك 🧑🏻‍💻📑** \n\n**⪼** `.وضع المطور تفعيل` \n**لـ تفعيـل وضـع المطـورين المسـاعدين** \n\n**⪼** `.وضع المطور تعطيل` \n**لـ تعطيـل وضـع المطـورين المسـاعدين** \n\n**⪼** `.تحكم كامل` \n**- اعطـاء المطـورين المرفـوعيـن صلاحيـة التحكـم الكـاملـه بالاوامــر ✓** \n\n**⪼** `.تحكم آمن` \n**- اعطـاء المطـورين المرفـوعيـن صلاحيـة التحكـم الآمـن لـ الاوامــر الامنـه فقـط ✓** \n\n**⪼** `.تحكم` + اسم الامـر\n**- اعطـاء المطـورين المرفـوعيـن صلاحيـة التحكـم بأمـر واحـد فقـط او عـدة اوامـر معينـه ✓ .. مثـال (.تحكم ايدي) او (.تحكم ايدي فحص كتم)**\n\n**⪼** `.ايقاف تحكم كامل` \n**- ايقـاف صلاحيـة التحكـم الكـاملـه بالاوامــر للمطـورين المرفـوعيـن ✓** \n\n**⪼** `.ايقاف تحكم آمن` \n**- ايقـاف صلاحيـة التحكـم الآمـن لـ الاوامــر الآمنـه للمطـورين المرفـوعيـن ✓** \n\n**⪼** `.ايقاف تحكم` + اسم الامـر \n**- ايقـاف صلاحيـة التحكـم المعطـاه لـ امـر واحـد فقـط او عـدة اوامـر للمطـورين المرفـوعيـن ✓ .. مثـال (.ايقاف تحكم ايدي) او (.ايقاف تحكم ايدي فحص كتم)** \n\n**⪼** `.التحكم`  /  `.التحكم المعطل` \n**- لـ عـرض قائمـة بالاوامـر المسمـوحـه والغيـر مسمـوحـه للمطـوريـن التحكـم فيهـا 🛃🚷** \n\n𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪")
@zedub.zed_cmd(pattern="م24(?: |$)(.*)") 
async def zed(event):
    await edit_or_reply(event, "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - قـائمــة الاوامــر الـذاتيــة](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⪼** `.تفعيل الذاتيه`\n**لـ تفعيـل الحفظ التلقائي للذاتيـه**\n**سوف يقوم حسابك بحفظ الذاتيه تلقائياً في حافظة حسابك عندما يرسل لك اي شخص ميديـا ذاتيـه**\n\n**⪼** `.تعطيل الذاتيه`\n**لـ تعطيـل الحفظ التلقائي للذاتيـه**\n\n**⪼** `.ذاتيه`\n**بالـرد ؏ــلى صـوره ذاتيـه لحفظهـا في حال كان امر الحفظ التلقائي معطـل**\n\n\n**⪼** `.اعلان`\n**الامـر + الوقت بالدقائق + الرسـاله**\n**امـر مفيـد لجماعـة التمويـل لـ عمـل إعـلان مـؤقت بالقنـوات**\n\n𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪")


#الكـالبـاك ابديـت - زدثـــون
@zedub.tgbot.on(CallbackQuery(data=re.compile(rb"aahmed")))
@check_owner
async def on_plug_in_callback_query_handler(event):
    buttons = [[Button.inline("❶", data="ahmed1"), Button.inline("❷", data="ahmed2"), Button.inline("❸", data="ahmed3"), Button.inline("❹", data="ahmed4"),],[Button.inline("❺", data="ahmed5"), Button.inline("❻", data="ahmed6"), Button.inline("❼", data="ahmed7"), Button.inline("❽", data="ahmed8"),],[Button.inline("❾", data="ahmed9"), Button.inline("❿", data="ahmad10"), Button.inline("⓫", data="ahmad11"),],[Button.inline("⓬", data="ahmad12"), Button.inline("⓭", data="ahmad13"), Button.inline("⓮", data="ahmad14"), Button.inline("⓯", data="ahmad15"),],[Button.inline("⓰", data="ahmad16"), Button.inline("⓱", data="ahmad17"),],[Button.inline("⓲", data="ahmad18"), Button.inline("⓳", data="ahmad19"), Button.inline("⓴", data="ahmadd20"),]]
    await event.edit(Malath, buttons=buttons)

@zedub.tgbot.on(CallbackQuery(data=re.compile(rb"ahmed1")))
@check_owner
async def zed_handler(event):
    zelzal = "⤶ عـذراً عـزيـزي 🤷🏻‍♀\n⤶ هـذه اللوحه لا تشتغل في الخاص\n⤶ لـ إظهـار لوحـة الاوامـر هنـا 👇\n\n⤶ ارســل (.اوامري)"
    buttons = [[Button.inline("رجــوع", data="aahmed")]]
    orden1 = "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر البحـث والتحميــل](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n⪼ `.بحث` + اسـم الاغنيـه\n**لـ تحميـل الاغـاني مـن يوتيـوب بدقه خفيفـه وتحميـل اسـرع**\n\n⪼ `.يوت` + كلمـه او بالـرد ع رابـط\n**لـ تحميـل الصوت والفيديـو بعـدة صيـغ مـن اليـوتيـوب بواسطـة لوحـه انلايـن شفافـه**\n\n⪼ `.فيديو` + اسـم المقطـع\n**لـ تحميـل مقـاطع الفيديـو مـن يوتيـوب**\n\n⪼ `.تحميل صوت` + رابـط\n**لـ تحميـل المقـاطع الصـوتيه من يوتيـوب عبر الرابـط**\n\n⪼ `.تحميل فيديو` + رابـط\n**لـ تحميـل مقـاطع الفيـديـو من يوتيـوب عبر الرابـط**\n\n⪼ `.يوتيوب`+ كلمـه\n**لـ البحث عـن روابـط بالكلمـه ع يوتيـوب **\n\n⪼ `.انستا` + رابـط\n**لـ تحميـل الصـور ومقـاطع الفيديـو مـن الانستجـرام**\n\n⪼ `.صور` + كلمـه\n**لـ البحث وتحميـل الصـور من جوجـل بدقـه HD**\n\n⪼ `.ملصقات` + كلمـه\n**لـ البحث عن حـزم ملصقـات على تيليجـرام..**\n\n⪼ `.متحركه` + كلمـه\n**لـ البحث عن صـور متحركـه من جـوجـل..**\n\n⪼ `.تيك` + رابـط او بالـرد ع رابـط\n**لـ تحميـل مقاطـع الفيديـو من تيك توك**\n\n⪼ `.لايكي` + رابـط\n**لـ تحميـل مقاطـع الفيديـو من لايكـي**\n\n⪼ `.فيس` + رابـط او `.فيس` بالـرد ع رابـط\n**لـ تحميـل مقاطـع الفيديـو مـن فيس بـوك**\n\n⪼ `.تويتر` + رابـط\n**لـ تحميـل مقاطـع الفيديـو من تويتـر**\n\n⪼ `.بنترست` + رابـط\n**لـ تحميـل مقاطـع الفيديـو من بنتـرست**\n\n⪼ `.سناب` + رابـط\n**.سناب + رابـط لـ تحميـل مقاطـع الفيديـو من سناب شـات**\n\n⪼ `.ساوند` + رابـط\n**.ساوند + رابـط او بالـرد ع رابـط لـ تحميـل الاغـاني مـن سـاونـد كلـود عـبر الرابـط**\n\n\n**• اوامــر البحث الذكيـه الخاصـه بـ تيليجـرام 🔎 :**\n**خاصه وحصرية ع سـورس زدثــون فقـط**\n\n⪼ `.تلي` + كلمة\n** امـر بحث خاص داخل تيليجـرام  لـ البحث عن قنوات + مجموعات بالكلمـه يعطيك قائمة بالقنوات والمجموعات الموجوده ع التلي**\n\n⪼ `.كلمه` + الكلمة\n** امـر بحث خاص داخل مجموعات تيليجـرام  لـ البحث عن كلمة محدده داخل المجموعة يعطيك قائمة بروابط الرسائل المحتويه ع الكلمة داخل المجموعة**"
    try:
        await event.edit(orden1, buttons=buttons, link_preview=False)
    except Exception:
        await event.answer(zelzal, cache_time=0, alert=True)
@zedub.tgbot.on(CallbackQuery(data=re.compile(rb"ahmed2")))
@check_owner
async def zed_handler(event):
    zelzal = "⤶ عـذراً عـزيـزي 🤷🏻‍♀\n⤶ هـذه اللوحه لا تشتغل في الخاص\n⤶ لـ إظهـار لوحـة الاوامـر هنـا 👇\n\n⤶ ارســل (.اوامري)"
    text = "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر البـــوت 🦾🤖](t.me/ANENMUS) .\n\n⪼ `.اعاده تشغيل`\n**لـ لتـرسيت واعـادة تشغيـل البـوت**\n\n⪼ `.ايقاف البوت`\n**لـ ايقـاف البـوت عـن العمـل والغـاء التنصـيب**\n\n⪼ `.تحديث`\n**لـ البحـث عـن تحديثـات وتحديث البـوت**\n\n⪼ `.تحديث الان`\n**لـ التحـديث الاولـي لـ البـوت لـ التنصيـب الثـانوي**\n\n⪼ `.تحديث البوت`\n**لـ التحـديث الثـانوي لـ البـوت لـ التنصيـب الاولـي والثـانوي**\n\n⪼ `.فحص`\n**لـ فحص قاعدة البيانات وعـرض اصـدار السورس ولغة بايثـون ومكتبة تيليثون**\n\n⪼ `.سليب` او `.سليب_ميديا`\n**لـ جعل البـوت في وضع النـوم او الإسبات ويتم ايقافه عند ارسالك لـ اي رسالة**\n\n⪼ `.الانترنت` او `.الانترنت صورة`\n**لـ عرض سرعة الانتـرنت (الرفـع & التحميـل) في سيرفـر البوت الخاص بك**\n\n⪼ `.المساعد`\n**لـ عـرض قائمـة اوامـر المطـور المسـاعد**\n\n⪼ `.الاذاعه`\n**لـ عـرض اوامـر الاذاعـه والتوجيـه**\n\n⪼ `.النظام`\n**لـ لعـرض معلومـات نظـام البـوت الخـاص بك**\n\n⪼ `.السرعه`\n**لـ قياس سرعة الرفع والتحميل في سيرفر البوت الخاص بك**\n\n⪼ `.فرمته`\n**لـ حذف المجلدات والملفات والعمليات المخزنه مؤقتـاً في سيرفر البوت الخاص بك**\n\n⪼ `.فاراتي`\n**لـ عـرض جميـع فارات تنصيبك**\n\n⪼ `.تاريخ التنصيب`\n**لـ عـرض تاريـخ بـدء تنصيبك على سـورس زدثــون**\n\n**•❐• لعـرض اصـدار السـورس ارسـل** `.سورس`\n**•❐• لعـرض قنـوات السـورس ارسـل** `.زدثون`\n\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪"
    zilzal = [[Button.inline("رجــوع", data="aahmed")]]
    try:
        await event.edit(text, buttons=zilzal, link_preview=False)
    except Exception:
        await event.answer(zelzal, cache_time=0, alert=True)
@zedub.tgbot.on(CallbackQuery(data=re.compile(rb"ahmed3")))
@check_owner
async def zed_handler(event):
    zelzal = "⤶ عـذراً عـزيـزي 🤷🏻‍♀\n⤶ هـذه اللوحه لا تشتغل في الخاص\n⤶ لـ إظهـار لوحـة الاوامـر هنـا 👇\n\n⤶ ارســل (.اوامري)"
    text = "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر الوقتـــي ⌚️](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n⪼ `.الاسم تلقائي`\n\n⪼ `.البايو تلقائي`\n\n⪼ `.البروفايل تلقائي` \n\n⪼ `.انهاء الاسم` / `.انهاء البايو` / `.انهاء البروفايل`\n\n⪼ `.اوامر الوقتي`\n\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪"
    zilzal = [[Button.inline("رجــوع", data="aahmed")]]
    try:
        await event.edit(text, buttons=zilzal, link_preview=False)
    except Exception:
        await event.answer(zelzal, cache_time=0, alert=True)
@zedub.tgbot.on(CallbackQuery(data=re.compile(rb"ahmed4")))
@check_owner
async def zed_handler(event):
    zelzal = "⤶ عـذراً عـزيـزي 🤷🏻‍♀\n⤶ هـذه اللوحه لا تشتغل في الخاص\n⤶ لـ إظهـار لوحـة الاوامـر هنـا 👇\n\n⤶ ارســل (.اوامري)"
    text = "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر المجمــوعــه¹](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n⪼ `.البوتات`\n\n⪼ `.قفل البوتات` / `.فتح البوتات`\n\n⪼ `.قفل الدردشه` / `.فتح الدردشه`\n\n⪼ `.قفل الصور` / `.فتح الصور`\n\n⪼ `.قفل الملصقات` / `.فتح الملصقات`\n\n⪼ `.قفل المتحركه` / `.فتح المتحركه`\n\n⪼ `.قفل الاضافه` / `.فتح الاضافه`  \n\n⪼ `.قفل الدخول` / `.فتح الدخول `\n\n⪼ `.قفل الميديا` / `.فتح الميديا `\n\n⪼ `.قفل تعديل الميديا` / `.فتح تعديل الميديا `\n\n⪼ `.قفل الفشار` / `.فتح الفشار`\n\n⪼ `.قفل الفارسيه` / `.فتح الفارسيه`\n\n⪼ `.قفل الروابط` / `.فتح الروابط`\n\n⪼`.قفل المعرفات` / `.فتح المعرفات`\n\n⪼ `.قفل التوجيه` / `.فتح التوجيه`\n\n⪼ `.قفل الانلاين` / `.فتح الانلاين`\n\n⪼ `.قفل المميز` / `.فتح المميز`\n\n⪼ `.قفل التفليش` / `.فتح التفليش`\n\n⪼ `.قفل الكل` / `.فتح الكل`\n\n⪼ `.قيد`   لتقييـد المحتـوى\n\n⪼ `.الاعدادات`\n\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪"
    zilzal = [[Button.inline("رجــوع", data="aahmed")]]
    try:
        await event.edit(text, buttons=zilzal, link_preview=False)
    except Exception:
        await event.answer(zelzal, cache_time=0, alert=True)
@zedub.tgbot.on(CallbackQuery(data=re.compile(rb"ahmed5")))
@check_owner
async def zed_handler(event):
    zelzal = "⤶ عـذراً عـزيـزي 🤷🏻‍♀\n⤶ هـذه اللوحه لا تشتغل في الخاص\n⤶ لـ إظهـار لوحـة الاوامـر هنـا 👇\n\n⤶ ارســل (.اوامري)"
    text = "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر المجمــوعــه²](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n⪼ `.الرابط`\n\n⪼`.رسائلي` / `.رسائله` \n\n⪼ `.حذف رسائلي`\n\n⪼ `.غادر`\n\n⪼ `.رفع مشرف`\n\n⪼ `.تنزيل مشرف`\n\n⪼ `.رفع مالك`\n\n⪼ `.الاعدادات`\n\n⪼ `.تاك` / `.all` \n\n⪼ `ايقاف التاك` \n\n\n⪼ `.احصائياتي`\n\n⪼ `.كروباتي الكل` / `.كروباتي ادمن` / `.كروباتي مالك`\n\n⪼ `.قنواتي الكل` / `.قنواتي ادمن` / `.قنواتي مالك`\n\n⪼ `.الاعضاء` / `المشرفين` \n\n⪼ `.البوتات`\n\n⪼ `.المحذوفين`\n\n⪼ `.مسح المحظورين`\n\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪"
    zilzal = [[Button.inline("رجــوع", data="aahmed")]]
    try:
        await event.edit(text, buttons=zilzal, link_preview=False)
    except Exception:
        await event.answer(zelzal, cache_time=0, alert=True)
@zedub.tgbot.on(CallbackQuery(data=re.compile(rb"ahmed6")))
@check_owner
async def zed_handler(event):
    zelzal = "⤶ عـذراً عـزيـزي 🤷🏻‍♀\n⤶ هـذه اللوحه لا تشتغل في الخاص\n⤶ لـ إظهـار لوحـة الاوامـر هنـا 👇\n\n⤶ ارســل (.اوامري)"
    text = "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر الحســاب 🚹](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n⪼ `.ضع اسم` | `.ضع بايو` | `.ضع يوزر` | `.ضع صورة`\n**.الامـر بالـرد او + نـص لـ تغييـر اسـم او بايـو او صـورة حسابـك**\n\n⪼ `.ايدي` او `.ا`\n**.ايدي بالـرد او + معـرف/ايـدي الشخص لـ عـرض معلومـات الشخـص**\n\n⪼ `.الايدي`\n**.الايدي بالـرد لـ جلـب ايـدي الشخـص والمجمـوعـة**\n\n⪼ `.حزمة`\n**.صورته بالـرد / .صورته الكل بالـرد لـ جـلب جميـع بروفـايلات الشخـص**\n\n⪼ `.اسمي` / `.اسمه`\n**.اسمه بالـرد لـ جـلب اسـم الشخـص**\n\n⪼ `.الاسماء`\n**.الاسماء بالـرد / .الاسماء + معـرف او ايدي الشخـص لـ جـلب قائمـة بسجـل اسمـاء حسـاب الشخـص**\n\n⪼ `.المعرفات`\n**.المعرفات بالـرد / .المعرفات + معـرف او ايدي الشخـص لـ جـلب قائمـة بسجـل معـرفـات حسـاب الشخـص**\n\n⪼ `.تخزين الخاص تفعيل`\n**الامـر + تفعيل او تعطيل لـ تخـزين جميـع رسـائل الخـاص بـ كـروب التخـزين**\n\n⪼ `.تخزين الكروبات تفعيل`\n**الامـر + تفعيل او تعطيل لـ تخـزين جميـع تاكـات المجمـوعـةات بـ كـروب التخـزين**\n\n\n**- اوامــر حمـايــة الخــاص🛡 :**\n\n⪼ `.الحمايه تفعيل`\n**لـ تفعيـل حمايـة الخـاص لـ حسـابك**\n\n⪼ `.الحمايه تعطيل`\n**لـ تعطيـل حمايـة الخـاص لـ حسـابك**\n\n⪼ `.قبول`\n**لـ السمـاح لـ الشخـص بـ ارسـال رسـائل الخـاص اثنـاء تفعيـل حمـاية الخـاص بحسـابك بـدون تحـذير**\n\n⪼ `.رفض`\n**لـ رفـض الشخـص من ارسـال رسـائل الخـاص اثنـاء تفعيـل حمـاية الخـاص بحسـابك**\n\n⪼ `.مرفوض`\n**لـ حظـر الشخـص من الخـاص دون تحـذير**\n\n⪼ `.المقبولين`\n**لـ عـرض قائمـة بالاشخـاص المقبـولين**\n\n\n**- اوامــر الحظــر - الكتــم - الطــرد 🔕 :**\n\n⪼ `.حظر`  /  `.الغاء حظر`\n\n⪼ `.كتم`  /  `.الغاء كتم`\n\n⪼ `.طرد`\n\n⪼ `.ح عام`\n\n⪼ `.الغاء ح عام`\n\n⪼ `.ك عام`\n\n⪼ `.الغاء ك عام`\n\n⪼ `.ط عام`\n\n⪼ `.الحاظرهم`\n**لـ جلب قائمـه بالاشخاص المحظورين خاص**\n\n⪼ `.رسائلي` / `.رسائله`\n**لـ عـرض عـدد رسائلك او رسائل شخص في المجمـوعـة**\n\n⪼ `.حذف رسائلي` + عـدد\n**لـ حـذف رسائلك من المجمـوعـة**\n\n⪼ `.احذف` + معـرف\n**لـ حذف دردشـة مع شخص من الخاص**"
    zilzal = [[Button.inline("رجــوع", data="aahmed")]]
    try:
        await event.edit(text, buttons=zilzal, link_preview=False)
    except Exception:
        await event.answer(zelzal, cache_time=0, alert=True)
@zedub.tgbot.on(CallbackQuery(data=re.compile(rb"ahmed7")))
@check_owner
async def zed_handler(event):
    zelzal = "⤶ عـذراً عـزيـزي 🤷🏻‍♀\n⤶ هـذه اللوحه لا تشتغل في الخاص\n⤶ لـ إظهـار لوحـة الاوامـر هنـا 👇\n\n⤶ ارســل (.اوامري)"
    text = "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر تحـويـل الصيــغ 💡🎞](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n⪼ `.ملصق`\n\n⪼ `.حزمه`\n\n⪼ `.حزمة`\n\n⪼ `.معلومات الملصق`\n\n⪼ `.ملصقات`\n\n⪼ `.لملصق`\n\n⪼ `.لصوره`\n\n⪼ `.لفيد`\n\n⪼ `.دائري`\n\n⪼ `.لمتحركة`\n\n⪼ `.حول بصمه`\n\n⪼ `.حول صوت`\n\n⪼ `.لمتحركه`\n\n⪼ `.لمتحرك`\n\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪"
    zilzal = [[Button.inline("رجــوع", data="aahmed")]]
    try:
        await event.edit(text, buttons=zilzal, link_preview=False)
    except Exception:
        await event.answer(zelzal, cache_time=0, alert=True)
@zedub.tgbot.on(CallbackQuery(data=re.compile(rb"ahmed8")))
@check_owner
async def zed_handler(zedub):
    text = "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر الـفــارات 🎛](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎قائـمه اوامر تغييـر فـارات الصـور بأمـر واحـد فقـط - لـ اول مـره ع سـورس تليثـون يوزر بـوت 🦾 :** \n\n⪼ `.اضف صورة الحماية` بالـرد ع صـورة او ميديـا\n\n⪼ `.اضف صورة الفحص` بالـرد ع صـورة او ميديـا\n⪼ قنـاة كلايـش الفحـص @zzclll\n\n⪼ `.اضف صورة الوقتي` بالـرد ع صـورة او ميديـا\n\n⪼ `.اضف صورة الاوامر` بالـرد ع صـورة او ميديـا\n\n⪼ `.اضف صورة السورس` بالـرد ع صـورة او ميديـا\n\n⪼ `.اضف صورة الكتم` بالـرد ع صـورة او ميديـا\n\n⪼ `.اضف صورة البوت` بالـرد ع صـورة او ميديـا لـ اضـافة صـورة ستـارت للبـوت\n\n⪼ `.اوامر الفارات` لعـرض بقيـة اوامـر الفـارات\n\n\n**⎉╎قائـمه اوامر تغييـر كليشـة الايـدي :** \n\n⪼ `.اضف فار ايموجي الايدي` بالـرد ع الرمـز او الايموجـي\n\n⪼ `.اضف فار عنوان الايدي` بالـرد ع نـص العنـوان\n\n⪼ `.اضف فار خط الايدي` بالـرد ع الخـط او المستقيـم\n\n⪼ `.اضف كليشة الايدي` بالـرد ع الكليشـه مـن القنـاة @zziddd \n\n\n**⎉╎قائـمه اوامر تغييـر بقيـة الفـارات بأمـر واحـد فقـط :** \n\n⪼ `.اضف فار كليشة الحماية` بالـرد ع الكليشـة\n⪼ قنـاة كلايـش حمايـة الخـاص @zzkrr\n\n⪼ `.اضف فار كليشة الفحص` بالـرد ع الكليشـة\n⪼ قنـاة كلايـش الفحـص @zzclll\n\n⪼ `.اضف فار كليشة الحظر` بالـرد ع الكليشـة\n\n⪼ `.اضف فار كليشة البوت` بالـرد ع الكليشـة لـ اضـافة كليشـة ستـارت\n\n⪼ `.اضف فار رمز الوقتي` بالـرد ع رمـز\n\n⪼ `.اضف فار زخرفة الوقتي` بالـرد ع ارقـام الزغـرفه\n\n⪼ `.اضف فار البايو الوقتي` بالـرد ع البـايـو\n\n⪼ `.اضف فار اسم المستخدم` بالـرد ع اسـم\n\n⪼ `.اضف فار كروب الرسائل` بالـرد ع ايدي الكـروب\n\n⪼ `.اضف فار كروب السجل` بالـرد ع ايدي الكـروب\n\n⪼ `.اضف فار ايديي` بالـرد ع ايدي حسـابك\n\n⪼ `.اضف فار نقطة الاوامر` بالـرد ع الـرمز الجديـد\n\n⪼ `.اضف فار نوم الترحيب` بالـرد ع رقـم الساعة لبداية نوم الترحيب المؤقت\n\n⪼ `.اضف فار رسائل الحماية` بالـرد ع رقـم لعدد رسائل تحذيـرات حماية الخاص\n\n\n⪼ `.جلب فار` + اسـم الفـار\n\n⪼ `.حذف فار` + اسـم الفـار\n\n⪼ `.رفع مطور` بالـرد ع الشخـص لرفعـه مطـور تحكـم كامـل بالاوامـر\n\n⪼ `.حذف فار المطورين`\n\n**⎉╎قائـمه اوامر تغييـر المنطقـة الزمنيـة للوقـت 🌐:** \n\n⪼ `.وقت العراق` \n\n⪼ `.وقت مصر` \n\n⪼ `.وقت الامارات` \n\n⪼ `.وقت ايران` \n\n⪼ `.وقت الجزائر` \n\n⪼ `.وقت المغرب` \n\n⪼ `.وقت تركيا` "
    zilzal = [[Button.inline("رجــوع", data="aahmed")]]
    await zedub.edit(text, buttons=zilzal, link_preview=False)
@zedub.tgbot.on(CallbackQuery(data=re.compile(rb"ahmed9")))
@check_owner
async def zed_handler(zedub):
    text = "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر الـخدمــات العـامــه 🎡](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n⪼ `.مساعده`\n\n⪼ `.اوامر الفارات`\n\n⪼ `.اوامر السوبر`\n\n⪼ `.اوامر النشر`\n\n⪼ `.الترحيب`\n\n⪼ `.الردود`\n\n⪼ `.الاذاعه`\n\n⪼ `.التكرار`\n\n⪼ `.المساعد`\n\n⪼ `.الطقس`\n\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪"
    zilzal = [[Button.inline("رجــوع", data="aahmed")]]
    await zedub.edit(text, buttons=zilzal, link_preview=False)
@zedub.tgbot.on(CallbackQuery(data=re.compile(rb"ahmad10")))
@check_owner
async def zed_handler(zedub):
    text = "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر الالـعــاب 🎮🎳 ](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n⪼ `.بلاي` \n**- العــاب الانـلايـن لســورس زدثـــون 🕹**\n\n⪼ `.كت`\n**- اسئلـة كـت تـويت ⁉️**\n\n⪼ `.احكام`\n**- لعبــة احكــام الشهيــرة ⚖👩🏻‍⚖**\n\n⪼ `.عقاب`\n**- لعبــة عقــاب ⛓**\n\n⪼ `.اكس او`\n**- لعبــة اكـس او 🧩**\n\n⪼ `.نرد`\n**- لعبــة رمـي النــرد 🎲**\n\n⪼ `.سهم`\n**- لعبــة رمـي السهــم 🎯**\n\n⪼ `.سله`\n**- لعبــة كــرة السلــة 🏀**\n\n⪼ `.كرة`\n**- لعبــة كــرة القــدم ⚽️**\n\n⪼ `.حظ`\n**- لعبــة الحــظ 🎰**\n\n⪼ `.خيرني`\n**- لعبــة لـو خيـروك بالصـور ⁉️🌉**\n\n⪼ `.تويت`\n**- لعبــة كـت تـويت بالصـور ⁉️🌁**\n\n\n**- سيتـم اضـافــة المـزيــد من الالعــاب بالتحديثــات الجــايـه 🎭**"
    zilzal = [[Button.inline("رجــوع", data="aahmed")]]
    await zedub.edit(text, buttons=zilzal, link_preview=False)
@zedub.tgbot.on(CallbackQuery(data=re.compile(rb"ahmad11")))
@check_owner
async def zed_handler(zedub):
    text = "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - قائمــة اوامــر التسـليــه 🏂](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n⪼ `.تسليه1`\n⪼ `.تسليه2`\n⪼ `.تسليه3`\n⪼ `.تسليه4`\n⪼ `.تسليه5`\n⪼ `.تسليه6`\n⪼ `.تسليه7`\n⪼ `.تسليه8`\n⪼ `.تسليه9`\n⪼ `.تسليه10`\n\n**⎉╎قائـمه اوامــر التسـليـه الجـديـده حقـوق سـورس زدثـــون :**\n\n⪼ `.حيوان` بالـرد\n\n⪼ `.زاحف` بالـرد\n\n⪼ `.مشهور` بالـرد\n\n⪼ `.مشهوره` بالـرد\n\n⪼ `.التحشيش`\n\n⪼ `.معاني` + اسـم\n\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪"
    zilzal = [[Button.inline("رجــوع", data="aahmed")]]
    await zedub.edit(text, buttons=zilzal, link_preview=False)
@zedub.tgbot.on(CallbackQuery(data=re.compile(rb"ahmad12")))
@check_owner
async def zed_handler(zedub):
    text = "**⎉╎قائمــة اوامــر التحشيـش 🎃 :**\n**- اضغـط ع الامـر للنسـخ ثـم قـم بالـرد ع الشخـص**\n\n⪼ `.اوصف`  /  `.هينه` \n⪼ `.نسبه الحب`\n⪼ `.نسبه الانوثه`\n⪼ `.نسبه الغباء`\n⪼ `.نسبه النجاح`\n⪼ `.نسبه الانحراف`\n⪼ `.نسبه المثليه`\n⪼ `.نسبه الكراهيه`\n\n⪼ `.رفع تاج`  /  `.رفع بقلبي`\n⪼ `.رفع صاك`  /  `.رفع صاكه`\n⪼ `.رفع حات`  /  `.رفع حاته`\n⪼ `.رفع ورع`  /  `.رفع مزه`\n⪼ `.رفع مرتي`  /  `.رفع خطيبتي` \n⪼ `.رفع مطي`  /  `.رفع حمار`  /  `.رفع جلب`\n⪼ `.رفع حيوان`  /  `.رفع خروف` \n⪼ `.رفع بزون`  /  `.رفع جريذي`\n⪼ `.رفع فرخ`  /  `.رفع زباله`\n⪼ `.زاحف`  /  `.رفع جلب`\n⪼ `.رفع مرتبط`  /  `.رفع مرتبطه`\n⪼ `.رفع حبيبي`\n⪼ `.رفع مدير`  /  `.رفع منشئ`"
    zilzal = [[Button.inline("رجــوع", data="aahmed")]]
    await zedub.edit(text, buttons=zilzal, link_preview=False)
@zedub.tgbot.on(CallbackQuery(data=re.compile(rb"ahmad13")))
@check_owner
async def zed_handler(zedub):
    text = "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر الستـوريـات 🎆??](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n⪼ `.حالات واتس`\n**- اكثـر مـن 2000 فيديـو حالات واتسـاب قصيـرة 🎬**\n\n⪼`.ستوري انمي`\n**- مقاطـع ستوريـات انمـي قصيـرة 🎞**\n\n⪼ `.ادت`\n**- مقاطـع ادت منـوعـة 🎥**\n\n⪼ `.رياكشن`\n**- مقاطـع رياكشـن ترفيهيــه 📺**\n\n⪼ `.ميمز`\n**- بصمـات ميمـز تحشيـش 🎃**\n\n⪼ `.غنيلي`\n**- مقاطـع اغـانـي قصيـره 🎶**\n\n⪼ `.شعر`\n**- مقاطـع صـوت شعـريـه 🎙**\n\n⪼ `.رقيه`\n**- رقيـه شرعيـة لعـدة مشائـخ 🕋**\n\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪"
    zilzal = [[Button.inline("رجــوع", data="aahmed")]]
    await zedub.edit(text, buttons=zilzal, link_preview=False)
@zedub.tgbot.on(CallbackQuery(data=re.compile(rb"ahmad14")))
@check_owner
async def zed_handler(zedub):
    text = "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر الآفتـــارات والصــور 🎆🏖](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n⪼ `.ولد انمي`\n**- اكثـر مـن 2500 آفتـار آنمـي شبـاب 🙋🏻‍♂🎆**\n\n⪼`.بنت انمي`\n**- اكثـر مـن 1800 آفتـار آنمـي بنـات 🙋🏻‍♀🎆**\n\n⪼ `.رمادي`\n**- آفتـارات شبـاب رمـاديـه 🏂🏙**\n\n⪼ `.رماديه`\n**- آفتـارات بنـات رمـاديـه ⛹🏻‍♀🌁**\n\n⪼ `.بيست`\n**- آفتـارات بيست تطقيـم بنـات 👯‍♀🏖**\n\n⪼ `.حب`\n**- آفتـارات بيست تطقيـم حب ♥️🧚‍♂🧚‍♀**\n\n⪼ `.بنات`\n**- اكثـر مـن 2500 آفتـارات بنـات تمبلـر 💅🎆**\n\n⪼ `.ري اكشن`\n**- صـور رياكشـن تحشيـش 🎃😹**\n\n⪼ `.معلومه`\n**- صـوره ومعلومـه معلومـات عـامـه 🗺**\n\n\n 𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪"
    zilzal = [[Button.inline("رجــوع", data="aahmed")]]
    await zedub.edit(text, buttons=zilzal, link_preview=False)
@zedub.tgbot.on(CallbackQuery(data=re.compile(rb"ahmad15")))
@check_owner
async def zed_handler(zedub):
    text = "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر الصيـد & التشيكـر ❇️](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**✾╎اولاً قـائمـة اوامـر تشيكـر صيـد معـرفات تيليجـرام :** \n\n`.النوع`\n**⪼ لـ عـرض الانـوع التي يمكـن صيدهـا مع الامثـله**\n`.صيد` + النـوع\n**⪼ لـ صيـد يـوزرات عشوائيـه على حسب النـوع**\n`.حالة الصيد`\n**⪼ لـ معرفـة حالـة تقـدم عمليـة الصيـد**\n`.صيد ايقاف`\n**⪼ لـ إيقـاف عمليـة الصيـد الجاريـه**\n\n\n**✾╎ثانياً قـائمـة اوامـر تشيكـر تثبيت معـرفات تيليجـرام :** \n\n`.تثبيت_قناة` + اليوزر\n**⪼ لـ تثبيت اليـوزر بقنـاة معينـه اذا اصبح متاحـاً يتم اخـذه**\n`.تثبيت_حساب` + اليوزر\n**⪼ لـ تثبيت اليـوزر بحسـابك مباشـرة اذا اصبح متاحـاً يتم اخـذه**\n`.تثبيت_بوت` + اليوزر\n**⪼ لـ تثبيت اليـوزر في بـوت فـاذر اذا اصبح متاحـاً يتم اخـذه**\n\n`.حالة تثبيت_القناة`\n**⪼ لـ معرفـة حالـة تقـدم التثبيت التلقـائـي على القنـاة**\n`.حالة تثبيت_الحساب`\n**⪼ لـ معرفـة حالـة تقـدم التثبيت التلقـائـي على حسابـك**\n`.حالة تثبيت_البوت`\n**⪼ لـ معرفـة حالـة تقـدم التثبيت التلقـائـي على بـوت فـاذر**\n\n`.ايقاف تثبيت_القناة`\n**⪼ لـ إيقـاف عمليـة تثبيت_القناة التلقـائـي**\n`.ايقاف تثبيت_الحساب`\n**⪼ لـ إيقـاف عمليـة تثبيت_الحساب التلقـائـي**\n`.ايقاف تثبيت_البوت`\n**⪼ لـ إيقـاف عمليـة تثبيت_البوت التلقـائـي**\n\n\n**- ملاحظـات مهمـه قبـل استخـدام اوامـر الصيـد والتثبيت :**\n**⪼** تأكد من ان حسابك يوجد فيه مساحه لانشاء قناة عامة (قناة بمعرف)\n**⪼** اذا كان لا يوجد مساحه لانشاء قناة عامة قم بارسال يوزر اي قناة من قنوات حسابك وبالرد ع يوزرها ارسل احد اوامر الصيد\n**⪼** لا تقم بـ ايقاف الصيد حتى ولو استمر الصيد ايام\n**⪼** تحلى بالصبر وكرر محاولات الصيد حتى تصيد يوزر\n**⪼** كل نوع من اليوزرات يختلف عن الاخر من حيث نسبة الصيد\n**⪼ التثبيت هو تثبيت يوزر محدد حتى ماينسرق منك عندما يصير متاح**\n\n**- انضـم للقنـاة ~ @RRRDB**\n**⪼ لـ رؤيـة بعـض اليـوزرات التي قام بصيدهـا منصبيـن زدثــون**"
    zilzal = [[Button.inline("رجــوع", data="aahmed")]]
    await zedub.edit(text, buttons=zilzal, link_preview=False)
@zedub.tgbot.on(CallbackQuery(data=re.compile(rb"ahmad16")))
@check_owner
async def zed_handler(zedub):
    text = "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر النشــر التلقــائي 🌐](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎قـائمـة اوامـر النشـر التلقـائي الخاص بسـورس زدثـــون🦾 :**\n\n**- هي عبارة عن فكـرة تسمح لـ البوت الموجود بحسابك بنشـر منشورات تلقائيـه بقناتك من قناة انت تحددهـا** \n\n\n⪼`.تلقائي`\n**⪼ الامـر + (معـرف/ايـدي/رابـط) القنـاة المـراد النشـر التلقـائي منهـا .. استخـدم الامـر داخـل قناتك✓**\n\n⪼ `.ستوب`\n**⪼ الامـر + (معـرف/ايـدي/رابـط) القنـاة المـراد ايقـاف النشـر التلقـائي منهـا .. استخـدم الامـر داخـل قناتك ✓**\n\n\n**- ملاحظـه 🧧:**\n**- الاوامـر صـارت تدعـم القنـوات الخاصه ايضـاً والمعـرفات والروابـط ايضاً الى جـانب الايـدي .. ع عكس بقية السورسات 🏂🎗**\n**🛃 سيتـم اضـافة المزيـد من اوامــر النشـر التلقـائي بالتحديثـات الجـايه**"
    zilzal = [[Button.inline("رجــوع", data="aahmed")]]
    await zedub.edit(text, buttons=zilzal, link_preview=False)
@zedub.tgbot.on(CallbackQuery(data=re.compile(rb"ahmad17")))
@check_owner
async def zed_handler(zedub):
    text = "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر تجميــع النقــاط 🛂](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎قـائمـة اوامـر تجميـع نقـاط بوتـات تمـويـل الخاص بسـورس زدثـــون🦾 :** \n\n⪼ `.المليار`\n**⪼ لـ تجميـع النقـاط مـن بـوت المليـار ( @EEOBot ) .. تلقـائيـاً ✓**\n\n⪼ `.العرب`\n**⪼ لـ تجميـع النقـاط مـن بـوت العـرب ( @xnsex21bot ) .. تلقـائيـاً ✓**\n\n⪼ `.دعمكم`\n**⪼ لـ تجميـع النقـاط مـن بـوت دعمكـم ( @DamKombot ) .. تلقـائيـاً ✓**\n\n⪼ `.الجوكر`\n**⪼ لـ تجميـع النقـاط مـن بـوت الجوكـر ( @A_MAN9300BOT ) .. تلقـائيـاً ✓**\n\n⪼ `.الجنرال`\n**⪼ لـ تجميـع النقـاط مـن بـوت الجنــرال ( @MARKTEBOT ) .. تلقـائيـاً ✓**\n\n⪼ `.المليون`\n**⪼ لـ تجميـع النقـاط مـن بـوت المليــون ( @qweqwe1919bot ) .. تلقـائيـاً ✓**\n\n⪼ `.سمسم`\n**⪼ لـ تجميـع النقـاط مـن بـوت سمـسـم ( @SMSMWAbot ) .. تلقـائيـاً ✓**\n\n⪼ `.تناهيد`\n**⪼ لـ تجميـع النقـاط مـن بـوت تناهيـد ( @Ncoe_bot ) .. تلقـائيـاً ✓**\n\n\n⪼ `.المليار ايقاف`\n**⪼ لـ ايقـاف عمليـة تجميـع النقـاط من بوت المليـار ..**\n\n⪼ `.الجوكر ايقاف`\n**⪼ لـ ايقـاف عمليـة تجميـع النقـاط من بوت الجوكـر ..**\n\n⪼ `.الجنرال ايقاف`\n**⪼ لـ ايقـاف عمليـة تجميـع النقـاط من بوت الجنــرال ..**\n\n⪼ `.المليون ايقاف`\n**⪼ لـ ايقـاف عمليـة تجميـع النقـاط من بوت المليــون ..**\n\n⪼ `.سمسم ايقاف`\n**⪼ لـ ايقـاف عمليـة تجميـع النقـاط من بوت سمـسـم ..**\n\n⪼ `.تناهيد ايقاف`\n**⪼ لـ ايقـاف عمليـة تجميـع النقـاط من بوت تناهيـد ..**\n\n\n**⎉╎قـائمـة اوامـر تجميـع نقـاط العـاب بـوت وعــد🦾 :** \n\n`.بخشيش وعد` / `.ايقاف بخشيش وعد\n`.راتب وعد` / `.ايقاف راتب وعد`\n`.استثمار وعد` / `.ايقاف استثمار وعد`\n`.سرقة وعد` / `.ايقاف سرقة وعد`\n**(الامـر + ايـدي الشخـص)**\n`.كلمات وعد`\n**(الامـر + عـدد الاعـادة للامـر)**\n**⪼ لـ تجميـع نقـاط لعبـة البنـك وغيرهـا في بوت وعـد او اي بوت تلقائيـاً ✓ **"
    zilzal = [[Button.inline("رجــوع", data="aahmed")]]
    await zedub.edit(text, buttons=zilzal, link_preview=False)
@zedub.tgbot.on(CallbackQuery(data=re.compile(rb"ahmad18")))
@check_owner
async def zed_handler(zedub):
    text = "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر الاشتــراك الاجبــاري 🛗](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎قـائمـة اوامـر الاشتـراك الاجبـاري الخاص بسـورس زدثـــون🦾 :**\n\n**- اولاً اوامـر اضافـة القنـاة المطلوبـه للفـارات :**\n\n⪼ `.ضع اشتراك الخاص` / `.وضع اشتراك الخاص`\n**⪼ لـ اضافة قناة اشتراك الخاص للفارات .. استخدم الامر + معرف القناة او الامـر فقـط داخل القناة ✓**\n\n⪼ `.ضع اشتراك الكروب` / `.وضع اشتراك الكروب`\n**⪼ لـ اضافة قناة اشتراك الكروب للفارات .. استخدم الامـر + معرف القناة داخل الكروب ✓**\n\n\n**- ثانيـاً اوامـر تفعيـل الاشتـراك بعـد اضافة القنـاة :**\n\n⪼`.تفعيل اشتراك الخاص`\n**⪼ لـ تفعيـل الاشتـراك الاجبـاري للخـاص بعـد اضافة القنـاة ✓**\n\n**⪼ لـ تفعيـل الاشتـراك الاجبـاري للكروب مايحتاج امـر .. اول ماتضيف القناة يتفعل الاشتراك تلقائي ✓**\n\n\n**- ثالثـاً اوامـر تعطيـل الاشتــراك :**\n\n⪼ `.تعطيل اشتراك الخاص`\n**⪼ لـ تعطيـل الاشتـراك الاجبـاري للخـاص اذا كـان مفعـل ✓**\n\n⪼ `.تعطيل اشتراك الكروب`\n**⪼ لـ تعطيـل الاشتـراك الاجبـاري للكـروب اذا كـان مفعـل ✓**"
    zilzal = [[Button.inline("رجــوع", data="aahmed")]]
    await zedub.edit(text, buttons=zilzal, link_preview=False)
@zedub.tgbot.on(CallbackQuery(data=re.compile(rb"ahmad19")))
@check_owner
async def zed_handler(zedub):
    text = "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــر الاضـافة والتفليــش](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎قـائمـة اوامـر اضـافة الاعضـاء وتفليـش الكروبـات الخاص بسـورس زدثـــون🦾 :** \n\n**- اولاً اوامــر اضـافة الاعضـاء كالتالـي :**\n\n⪼ `.ضيف`\n**⪼ .ضيف + رابط المجموعـه لـ اضـافة الاعضـاء استخـدم الامـر بالمجمـوعـة الهـدف مع اضافه رابط كروبك لـ الامـر ✓**\n\n\n**- ثانيـاً اوامــر تفليــش الكروبـات كالتالـي :**\n\n⪼ `.تفليش`\n**⪼ لـ تفليـش جميـع اعضـاء مجمـوعـه معينـه .. استخـدم الامـر داخـل المجمـوعـة + تحتـاج رتبـة مشـرف بالمجمـوعـة ✓**\n\n⪼`.تفليش بالطرد`\n**لـ تفليـش جميـع اعضـاء مجمـوعـه معينـه بالطـرد فقـط وليس بالحظـر .. استخـدم الامـر داخـل المجمـوعـة + تحتـاج رتبـة مشـرف بالمجمـوعـة ✓**\n\n⪼ `.حظر_الكل`\n**⪼ حظـر وتفليـش اعضـاء الكروب عبر بوت الحماية المرفوع بالكروب + ماتحتاج اشراف انت فقط تحتاج رتبه ادمن ومافوق بالبوت ✓**\n\n⪼ `.طرد_الكل`\n**⪼ طـرد وتفليـش اعضـاء الكروب عبر بوت الحماية المرفوع بالكروب + ماتحتاج اشراف انت فقط تحتاج رتبه ادمن ومافوق بالبوت ✓**\n\n⪼ `.كتم_الكل`\n**⪼ كتـم اعضـاء الكروب عبر بوت الحماية المرفوع بالكروب + ماتحتاج اشراف انت فقط تحتاج رتبه ادمن ومافوق بالبوت ✓**\n\n⪼ `.الغاء التفليش`\n**⪼ لـ الغـاء عمليـة التفليـش او الكتـم الجاريـه وايقافهـا ✓**"
    zilzal = [[Button.inline("رجــوع", data="aahmed")]]
    await zedub.edit(text, buttons=zilzal, link_preview=False)
@zedub.tgbot.on(CallbackQuery(data=re.compile(rb"ahmadd20")))
@check_owner
async def zed_handler(zedub):
    text = "[ᯓ 𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - (اوامــر النشــر العـام (السـوبــرات 🎡](t.me/ANENMUS) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎قـائمـة اوامـر السـوبـر (النشـر العـام) الخاصـه بـ سـورس زدثـــون ♾ :**\n\n`.سوبر`\n**⪼ الامـر + عـدد الثـوانـي + عـدد مـرات التكـرار (بالـرد ع رسـالة او ميديـا)**\n**⪼ لـ النشـر التكـراري العـام بكـل مجموعـات قائمـة السـوبـر ( خـاص بجماعـة بالسـوبـرات ) ...✓**\n\nٴ┄─┄─┄─┄┄─┄─┄─┄─┄┄\n\n`.ايقاف سوبر`\n**⪼ استخـدم الامـر داخـل المجموعـة المحـدده ...**\n**⪼ لـ إيقـاف النشـر العـام عـن مجموعـة معينـه ...✓**\n\nٴ┄─┄─┄─┄┄─┄─┄─┄─┄┄\n\n`.ايقاف السوبرات`\n**⪼ لـ إيقـاف النشـر التكـراري العـام عـن جميـع المجموعـات ...✓**\n\nٴ┄─┄─┄─┄┄─┄─┄─┄─┄┄\n\n`.اضف سوبر`\n**⪼ استخـدم الامـر داخـل المجموعـة المحـدده ...**\n**⪼ لـ اضافة مجموعـة محـددة لـ قائمـة مجموعـات السوبـر ...✓**\n\nٴ┄─┄─┄─┄┄─┄─┄─┄─┄┄\n\n`.حذف سوبر`\n**⪼ استخـدم الامـر داخـل المجموعـة المحـدده ...**\n**⪼ لـ حـذف مجموعـة محـددة مـن قائمـة مجموعـات السوبـر ...✓**\n\nٴ┄─┄─┄─┄┄─┄─┄─┄─┄┄\n\n`.السوبرات`\n**⪼ لـ جلب قائمـة مجموعـات السوبـر الخاصـه بك ...✓**\n\nٴ┄─┄─┄─┄┄─┄─┄─┄─┄┄\n\n`.حذف السوبرات`\n**⪼ لـ حـذف وتصفيـر قائمـة مجموعـات السوبـر الخاصـه بك ...✓**\n\nٴ┄─┄─┄─┄┄─┄─┄─┄─┄┄\n\n**⪼ مـلاحظــات هـامــه :**\n- اوامـر السوبـرات إضـافة جديـدة خاصـه وحصريـه بسـورس زدثــون¹ فقـط ...\n- تحديثات السوبـر متواصـلة لـ إضـافة كـل ماهـو جديـد بالتحديثـات الجايـه ...\n- نسعـى جاهـدين لـ جعـل اوامـر السوبـر سهـله وسلسـه لـكي توفـر لكـم الجهـد والتعب ...\n- شكـر خـاص لـ منصبيـن السـورس علـى افكـارهم الرائعـه والمفيـده ...\n\n𓆩 [𝗭𝗧𝗵𝗼𝗻 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/ZThon) 𓆪"
    zilzal = [[Button.inline("رجــوع", data="aahmed")]]
    await zedub.edit(text, buttons=zilzal, link_preview=False)


#لوحـة قنــوات الســورس
@zedub.tgbot.on(events.InlineQuery)
@check_owner
async def zed_handler(event):
    builder = event.builder
    result = None
    query = event.text
    await zedub.get_me()
    if query.startswith("زدثون") and event.query.user_id == zedub.uid:
        ZPIC = gvarstatus("ALIVE_PIC")
        buttons = [[Button.url("قنـاة السـورس", "https://t.me/ANENMUS"),],[Button.url("التحـديثـات", "https://t.me/ANENMUS"), Button.url("الفـارات", "https://t.me/ANENMUS"),],[Button.url("الشـروحـات¹", "https://t.me/ANENMUS"),],[Button.url("الشـروحـات²", "https://t.me/ANENMUS"),],[Button.url("مطـور السـورس", "https://t.me/ANENMUS"),]]
        if ZPIC and ZPIC.endswith((".jpg", ".png", "gif", "mp4")):
            result = builder.photo(ZPIC,text=Channels, buttons=buttons, link_preview=True)
        elif ZPIC and ZPIC.endswith((".gif", ".mp4")):
            result = builder.document(ZPIC,title="zedub",text=Channels,buttons=buttons,link_preview=True)
        else:
            result = builder.article(title="zedub",text=Channels,buttons=buttons,link_preview=True)
        await event.answer([result] if result else None)
@zedub.zed_cmd(pattern="زدثون")
async def repozedub(event):
    if event.fwd_from:
        return
    TG_BOT = Config.TG_BOT_USERNAME
    if event.reply_to_msg_id:
        await event.get_reply_message()
    response = await zedub.inline_query(TG_BOT, "زدثون")
    await response[0].click(event.chat_id)
    await event.delete()


@zedub.tgbot.on(InlineQuery)
@check_owner
async def zed_handler(event):
    builder = event.builder
    result = None
    query = event.text
    await zedub.get_me()
    if query.startswith("السورس") and event.query.user_id == zedub.uid:
        ZPIC = gvarstatus("ALIVE_PIC")
        buttons = [[Button.url("قنـاة الســورس", "https://t.me/ANENMUS")]]
        if ZPIC and ZPIC.endswith((".jpg", ".png")):
            result = builder.photo(ZPIC,text=Zelzal, buttons=buttons, link_preview=True)
        elif ZPIC and ZPIC.endswith((".gif", ".mp4")):
            result = builder.document(ZPIC,title="zedub",text=Zelzal,buttons=buttons,link_preview=True)
        else:
            result = builder.article(title="zedub",text=Zelzal,buttons=buttons,link_preview=True)
        await event.answer([result] if result else None)
@zedub.zed_cmd(pattern="السورس")
async def repozedub(event):
    if event.fwd_from:
        return
    TG_BOT = Config.TG_BOT_USERNAME
    if event.reply_to_msg_id:
        await event.get_reply_message()
    response = await zedub.inline_query(TG_BOT, "السورس")
    await response[0].click(event.chat_id)
    await event.delete()


@zedub.tgbot.on(InlineQuery)
@check_owner
async def zed_handler(event):
    builder = event.builder
    result = None
    query = event.text
    await zedub.get_me()
    if query.startswith("سورس") and event.query.user_id == zedub.uid:
        ZPIC = gvarstatus("ALIVE_PIC")
        buttons = [[Button.url("قنـاة الســورس", "https://t.me/ANENMUS")]]
        if ZPIC and ZPIC.endswith((".jpg", ".png")):
            result = builder.photo(ZPIC,text=Zelzal, buttons=buttons, link_preview=True)
        elif ZPIC and ZPIC.endswith((".gif", ".mp4")):
            result = builder.document(ZPIC,title="zedub",text=Zelzal,buttons=buttons,link_preview=True)
        else:
            result = builder.article(title="zedub",text=Zelzal,buttons=buttons,link_preview=True)
        await event.answer([result] if result else None)
@zedub.zed_cmd(pattern="سورس")
async def repozedub(event):
    if event.fwd_from:
        return
    TG_BOT = Config.TG_BOT_USERNAME
    if event.reply_to_msg_id:
        await event.get_reply_message()
    response = await zedub.inline_query(TG_BOT, "سورس")
    await response[0].click(event.chat_id)
    await event.delete()


async def get_user_from_event(event):
    if event.reply_to_msg_id:
        previous_message = await event.get_reply_message()
        user_object = await event.client.get_entity(previous_message.sender_id)
    else:
        user = event.pattern_match.group(1)
        if user.isnumeric():
            user = int(user)
        if not user:
            self_user = await event.client.get_me()
            user = self_user.id
        if event.message.entities:
            probable_user_mention_entity = event.message.entities[0]
            if isinstance(probable_user_mention_entity, MessageEntityMentionName):
                user_id = probable_user_mention_entity.user_id
                user_obj = await event.client.get_entity(user_id)
                return user_obj
        if isinstance(user, int) or user.startswith("@"):
            user_obj = await event.client.get_entity(user)
            return user_obj
        try:
            user_object = await event.client.get_entity(user)
        except (TypeError, ValueError) as err:
            await event.edit(str(err))
            return None
    return user_object


@zedub.tgbot.on(events.InlineQuery)
@check_owner
async def zed_handler(event):
    builder = event.builder
    result = None
    query = event.text
    await zedub.get_me()
    user = gvarstatus("who_id")
    if user is not None:
        zilzal = int(user)
    else:
        return
    try:
        user_zed = await event.client.get_entity(zilzal)
    except ValueError:
        return
    name_zed = user_zed.first_name
    if query.startswith("المطور") and event.query.user_id == zedub.uid:
        zelzal = f"**• عـزيـزي ** [{name_zed}](tg://user?id={user}) \n**حــســاب الـمــطـور ❖**"
        buttons = [[Button.url("الـمـطور", "https://t.me/ANYNMUS")]]
        result = builder.article(title="zedub",text=zelzal,buttons=buttons,link_preview=False)
        await event.answer([result] if result else None)
@zedub.zed_cmd(pattern="اليدوي(?: |$)(.*)")
async def repozedub(event):
    user = await get_user_from_event(event)
    if not user:
        return
    else:
    	addgvar("who_id", user.id)
    response = await event.client.inline_query(Config.TG_BOT_USERNAME, "اليدوي")
    await response[0].click(event.chat_id)
    await event.delete()


@zedub.tgbot.on(events.InlineQuery)
@check_owner
async def zed_handler(event):
    builder = event.builder
    result = None
    query = event.text
    await zedub.get_me()
    user = gvarstatus("who_id")
    if user is not None:
        zilzal = int(user)
    else:
        return
    try:
        user_zed = await event.client.get_entity(zilzal)
    except ValueError:
        return
    name_zed = user_zed.first_name
    if query.startswith("الفيزا") and event.query.user_id == zedub.uid:
        zelzal = f"**• عـزيـزي ** [{name_zed}](tg://user?id={user}) \n**• اليـك الفيـزا الخـاصـه بهيـروكـو↓**"
        buttons = [[Button.url("اضغــط هنــا", "https://t.me/ANYNMUS")]]
        result = builder.article(title="zedub",text=zelzal,buttons=buttons,link_preview=False)
        await event.answer([result] if result else None)
@zedub.zed_cmd(pattern="الفيزا(?: |$)(.*)")
async def repozedub(event):
    user = await get_user_from_event(event)
    if not user:
        return
    else:
    	addgvar("who_id", user)
    response = await event.client.inline_query(Config.TG_BOT_USERNAME, "الفيزا")
    await response[0].click(event.chat_id)
    await event.delete()


@zedub.tgbot.on(events.InlineQuery)
@check_owner
async def zed_handler(event):
    builder = event.builder
    result = None
    query = event.text
    await zedub.get_me()
    user = gvarstatus("who_id")
    if user is not None:
        zilzal = int(user)
    else:
        return
    try:
        user_zed = await event.client.get_entity(zilzal)
    except ValueError:
        return
    name_zed = user_zed.first_name
    if query.startswith("الهيروكو") and event.query.user_id == zedub.uid:
        zelzal = f"**• عـزيـزي ** [{name_zed}](tg://user?id={user}) \n**• اليـك شـرح إنشـاء حسـاب هيـروكـو↓**"
        buttons = [[Button.url("اضغــط هنــا", "https://t.me/ANYNMUS")]]
        result = builder.article(title="zedub",text=zelzal,buttons=buttons,link_preview=False)
        await event.answer([result] if result else None)
@zedub.zed_cmd(pattern="الهيروكو(?: |$)(.*)")
async def repozedub(event):
    user = await get_user_from_event(event)
    if not user:
        return
    else:
    	addgvar("who_id", user)
    response = await event.client.inline_query(Config.TG_BOT_USERNAME, "الهيروكو")
    await response[0].click(event.chat_id)
    await event.delete()


@zedub.tgbot.on(events.InlineQuery)
@check_owner
async def zed_handler(event):
    builder = event.builder
    result = None
    query = event.text
    await zedub.get_me()
    user = gvarstatus("who_id")
    if user is not None:
        zilzal = int(user)
    else:
        return
    try:
        user_zed = await event.client.get_entity(zilzal)
    except ValueError:
        return
    name_zed = user_zed.first_name
    if query.startswith("التنصيب") and event.query.user_id == zedub.uid:
        zelzal = f"**• عـزيـزي ** [{name_zed}](tg://user?id={user}) \n**• اليـك شـرح تنصيب السـورس ع هيـروكـو↓**"
        buttons = [[Button.url("اضغــط هنــا", "https://t.me/ANYNMUS")]]
        result = builder.article(title="zedub",text=zelzal,buttons=buttons,link_preview=False)
        await event.answer([result] if result else None)
@zedub.zed_cmd(pattern="التنصيب(?: |$)(.*)")
async def repozedub(event):
    user = await get_user_from_event(event)
    if not user:
        return
    else:
    	addgvar("who_id", user)
    response = await event.client.inline_query(Config.TG_BOT_USERNAME, "التنصيب")
    await response[0].click(event.chat_id)
    await event.delete()
